cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
<?xml version="1.0" encoding="UTF-8"?>
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
   <name>CC26x0</name>
   <version>2.3</version>
   <description>SimpleLink CC26xx Ultra-low power wireless MCU</description>
   <cpu>
      <name>CM3</name>
      <revision>r2p1</revision>
      <endian>little</endian>
      <mpuPresent>false</mpuPresent>
      <fpuPresent>false</fpuPresent>
      <nvicPrioBits>3</nvicPrioBits>
      <vendorSystickConfig>false</vendorSystickConfig>
   </cpu>
   <addressUnitBits>8</addressUnitBits>
   <width>32</width>
   <size>32</size>
   <access>read-write</access>
   <resetMask>0xFFFFFFFF</resetMask>
   <peripherals>
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
      
   <peripheral>
         <name>AON_BATMON</name>
         <description>Always On (AON) Battery And Temperature MONitor (BATMON) residing in the AON domain  Note: This module only supports 32 bit Read/Write access from MCU.  </description>
         <baseAddress>0x40095000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTL</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CALC_EN</name>
                     <description>CALC_EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>MEAS_EN</name>
                     <description>MEAS_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEASCFG</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PER</name>
                     <description>PER</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPP0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPP1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TEMPP2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BATMONP0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BATMONP1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOSTRP0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000028</resetValue>
               <fields>
                  <field>
                     <name>CFG2</name>
                     <description>CFG2</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>CFG1</name>
                     <description>CFG1</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASHPUMPP0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FALLB</name>
                     <description>FALLB</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>HIGHLIM</name>
                     <description>HIGHLIM</description>
                     <bitRange>[7:6]</bitRange>
                  </field>
                  <field>
                     <name>LOWLIM</name>
                     <description>LOWLIM</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>OVR</name>
                     <description>OVR</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAT</name>
               <description>Last Measured Battery Voltage

This register may be read while BATUPD.STAT = 1

</description>
               <addressOffset>40</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INT</name>
                     <description>INT</description>
                     <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                     <name>FRAC</name>
                     <description>FRAC</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BATUPD</name>
               <description>Battery Update

