cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
If CHCTL.CH1_EN = 1and CHCTL.CH1_CAPT_EN = 1, capture occurs on each rising edge of the event selected in AON_EVENT:RTCSEL.
</description>
               <addressOffset>40</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEC</name>
                     <description>SEC</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>SUBSEC</name>
                     <description>SUBSEC</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNC</name>
               <description>AON Synchronization

This register is used for synchronizing between MCU and entire AON domain. </description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WBUSY</name>
                     <description>WBUSY</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AON_SYSCTL</name>
         <description>This component controls AON_SYSCTL, which is the device's system controller.

Note: This module is only supporting 32 bit ReadWrite access from MCU
</description>
         <baseAddress>0x40090000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PWRCTL</name>
               <description>Power Management

This register controls bitfields for setting low level power management features such as selection of  regulator for VDDR supply and control of IO ring where certain segments can be enabled / disabled.
 </description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DCDC_ACTIVE</name>
                     <description>DCDC_ACTIVE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>EXT_REG_MODE</name>
                     <description>EXT_REG_MODE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DCDC_EN</name>
                     <description>DCDC_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESETCTL</name>
               <description>Reset Management

This register contains bitfields releated to system reset such as reset source and reset request  and control of brown out resets.  
</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x000000e0</resetValue>
               <fields>
                  <field>
                     <name>SYSRESET</name>
                     <description>SYSRESET</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DET_1_CLR</name>
                     <description>BOOT_DET_1_CLR</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DET_0_CLR</name>
                     <description>BOOT_DET_0_CLR</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DET_1_SET</name>
                     <description>BOOT_DET_1_SET</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DET_0_SET</name>
                     <description>BOOT_DET_0_SET</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>WU_FROM_SD</name>
                     <description>WU_FROM_SD</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>GPIO_WU_FROM_SD</name>
                     <description>GPIO_WU_FROM_SD</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DET_1</name>
                     <description>BOOT_DET_1</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DET_0</name>
                     <description>BOOT_DET_0</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>VDDS_LOSS_EN_OVR</name>
                     <description>VDDS_LOSS_EN_OVR</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_LOSS_EN_OVR</name>
                     <description>VDDR_LOSS_EN_OVR</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>VDD_LOSS_EN_OVR</name>
                     <description>VDD_LOSS_EN_OVR</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>VDDS_LOSS_EN</name>
                     <description>VDDS_LOSS_EN</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_LOSS_EN</name>
                     <description>VDDR_LOSS_EN</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>VDD_LOSS_EN</name>
                     <description>VDD_LOSS_EN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>CLK_LOSS_EN</name>
                     <description>CLK_LOSS_EN</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RESET_SRC</name>
                     <description>RESET_SRC</description>
                     <bitRange>[3:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLEEPCTL</name>
               <description>Sleep Mode

This register is used to unfreeze the IO pad ring after waking up from SHUTDOWN
</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IO_PAD_SLEEP_DIS</name>
                     <description>IO_PAD_SLEEP_DIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
