cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AON_WUC</name>
         <description>This component control the Wakeup controller residing in the AON domain.

Note: This module is only supporting 32 bit ReadWrite access from MCU

</description>
         <baseAddress>0x40091000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MCUCLK</name>
               <description>MCU Clock Management

This register contains bitfields related to the MCU clock.</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCOSC_HF_CAL_DONE</name>
                     <description>RCOSC_HF_CAL_DONE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>PWR_DWN_SRC</name>
                     <description>PWR_DWN_SRC</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXCLK</name>
               <description>AUX Clock Management

This register contains bitfields that are relevant for setting up the clock to the AUX domain.</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>PWR_DWN_SRC</name>
                     <description>PWR_DWN_SRC</description>
                     <bitRange>[12:11]</bitRange>
                  </field>
                  <field>
                     <name>SCLK_HF_DIV</name>
                     <description>SCLK_HF_DIV</description>
                     <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                     <name>SRC</name>
                     <description>SRC</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCUCFG</name>
               <description>MCU Configuration

This register contains power management related bitfields for the MCU domain.</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000000f</resetValue>
               <fields>
                  <field>
                     <name>VIRT_OFF</name>
                     <description>VIRT_OFF</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>FIXED_WU_EN</name>
                     <description>FIXED_WU_EN</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>SRAM_RET_EN</name>
                     <description>SRAM_RET_EN</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXCFG</name>
               <description>AUX Configuration

This register contains power management related signals for the AUX domain.</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>RAM_RET_EN</name>
                     <description>RAM_RET_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXCTL</name>
               <description>AUX Control

This register contains events and control signals for the AUX domain.
</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESET_REQ</name>
                     <description>RESET_REQ</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>SCE_RUN_EN</name>
                     <description>SCE_RUN_EN</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>SWEV</name>
                     <description>SWEV</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AUX_FORCE_ON</name>
                     <description>AUX_FORCE_ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRSTAT</name>
               <description>Power Status

This register is used to monitor various power management related signals in AON.  Most signals are for test, calibration and debug purpose only, and others can be used to detect that AUX or JTAG domains are powered up. 
</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0xe00000000</resetValue>
               <fields>
                  <field>
                     <name>AUX_PWR_DWN</name>
                     <description>AUX_PWR_DWN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>JTAG_PD_ON</name>
                     <description>JTAG_PD_ON</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>AUX_PD_ON</name>
                     <description>AUX_PD_ON</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>MCU_PD_ON</name>
                     <description>MCU_PD_ON</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>AUX_BUS_CONNECTED</name>
                     <description>AUX_BUS_CONNECTED</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AUX_RESET_DONE</name>
                     <description>AUX_RESET_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHUTDOWN</name>
               <description>Shutdown Control

This register contains bitfields required for entering shutdown mode</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL0</name>
               <description>Control 0

This register contains various chip level control and debug bitfields.
</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWR_DWN_DIS</name>
                     <description>PWR_DWN_DIS</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>AUX_SRAM_ERASE</name>
                     <description>AUX_SRAM_ERASE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>MCU_SRAM_ERASE</name>
                     <description>MCU_SRAM_ERASE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL1</name>
               <description>Control 1

This register contains various chip level control and debug bitfields.
</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCU_RESET_SRC</name>
                     <description>MCU_RESET_SRC</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>MCU_WARM_RESET</name>
                     <description>MCU_WARM_RESET</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RECHARGECFG</name>
               <description>Recharge Controller Configuration

This register sets all relevant patameters for controlling the recharge algorithm. 
</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADAPTIVE_EN</name>
                     <description>ADAPTIVE_EN</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>C2</name>
                     <description>C2</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>C1</name>
                     <description>C1</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>MAX_PER_M</name>
                     <description>MAX_PER_M</description>
                     <bitRange>[15:11]</bitRange>
                  </field>
                  <field>
                     <name>MAX_PER_E</name>
                     <description>MAX_PER_E</description>
                     <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                     <name>PER_M</name>
                     <description>PER_M</description>
                     <bitRange>[7:3]</bitRange>
                  </field>
                  <field>
                     <name>PER_E</name>
                     <description>PER_E</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RECHARGESTAT</name>
               <description>Recharge Controller Status

This register controls various status registers which are updated during recharge.  The register is mostly intended for test and debug.
</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VDDR_SMPLS</name>
                     <description>VDDR_SMPLS</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>MAX_USED_PER</name>
                     <description>MAX_USED_PER</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCCFG</name>
               <description>Oscillator Configuration

This register sets the period for Amplitude compensation requests sent to the oscillator control system. The amplitude compensations is only applicable when XOSC_HF is running in low power mode. </description>
               <addressOffset>56</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PER_M</name>
                     <description>PER_M</description>
                     <bitRange>[7:3]</bitRange>
                  </field>
                  <field>
                     <name>PER_E</name>
                     <description>PER_E</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAGCFG</name>
               <description>JTAG Configuration

This register contains control for configuration of the JTAG domain,- hereunder access permissions for each TAP. </description>
               <addressOffset>64</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000100</resetValue>
               <fields>
                  <field>
                     <name>JTAG_PD_FORCE_ON</name>
                     <description>JTAG_PD_FORCE_ON</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>JTAGUSERCODE</name>
               <description>JTAG USERCODE

Boot code copies the JTAG USERCODE to this register from where it is forwarded to the debug subsystem.</description>
               <addressOffset>68</addressOffset>
               <access>read-write</access>
               <resetValue>0x0b99a02f</resetValue>
               <fields>
                  <field>
                     <name>USER_CODE</name>
                     <description>USER_CODE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
