cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AUX_ADI4</name>
         <description>Configuration registers controlling analog peripherals of AUX. Registers Fields should be considered static unless otherwise noted (as dynamic)</description>
         <baseAddress>0x400cb000</baseAddress>
         <size>8</size><addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MUX0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMPA_IN</name>
                     <description>COMPA_IN</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>COMPA_REF</name>
                     <description>COMPA_REF</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUX1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>1</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMPA_IN</name>
                     <description>COMPA_IN</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUX2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>2</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCCOMPB_IN</name>
                     <description>ADCCOMPB_IN</description>
                     <bitRange>[7:3]</bitRange>
                  </field>
                  <field>
                     <name>COMPB_REF</name>
                     <description>COMPB_REF</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUX3</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>3</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADCCOMPB_IN</name>
                     <description>ADCCOMPB_IN</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISRC</name>
               <description>Current Source

Strength and trim control for current source</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TRIM</name>
                     <description>TRIM</description>
                     <bitRange>[7:2]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMP</name>
               <description>Comparator

Control COMPA and COMPB comparators</description>
               <addressOffset>5</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMPA_REF_RES_EN</name>
                     <description>COMPA_REF_RES_EN</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>COMPA_REF_CURR_EN</name>
                     <description>COMPA_REF_CURR_EN</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>COMPB_TRIM</name>
                     <description>COMPB_TRIM</description>
                     <bitRange>[5:3]</bitRange>
                  </field>
                  <field>
                     <name>COMPB_EN</name>
                     <description>COMPB_EN</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>COMPA_EN</name>
                     <description>COMPA_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUX4</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>7</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMPA_REF</name>
                     <description>COMPA_REF</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADC0</name>
               <description>ADC Control 0</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SMPL_MODE</name>
                     <description>SMPL_MODE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SMPL_CYCLE_EXP</name>
                     <description>SMPL_CYCLE_EXP</description>
                     <bitRange>[6:3]</bitRange>
                  </field>
                  <field>
                     <name>RESET_N</name>
                     <description>RESET_N</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADC1</name>
               <description>ADC Control 1</description>
               <addressOffset>9</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SCALE_DIS</name>
                     <description>SCALE_DIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCREF0</name>
               <description>ADC Reference 0

Control reference used by the ADC</description>
               <addressOffset>10</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REF_ON_IDLE</name>
                     <description>REF_ON_IDLE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>IOMUX</name>
                     <description>IOMUX</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>EXT</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>SRC</name>
                     <description>SRC</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCREF1</name>
               <description>ADC Reference 1

Control reference used by the ADC</description>
               <addressOffset>11</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VTRIM</name>
                     <description>VTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
