cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
AUX event source polarity for the event flags to the MCU domain

Note the inverse polarity (0 = high, 1 = low).</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC_IRQ</name>
                     <description>ADC_IRQ</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>OBSMUX0</name>
                     <description>OBSMUX0</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>ADC_FIFO_ALMOST_FULL</name>
                     <description>ADC_FIFO_ALMOST_FULL</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SMPH_AUTOTAKE_DONE</name>
                     <description>SMPH_AUTOTAKE_DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AON_WU_EV</name>
                     <description>AON_WU_EV</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVTOMCUFLAGS</name>
               <description>Events to MCU Domain Flags

AUX event flags going to the MCU domain

The flags may be cleared by writing 0 to these bits or writing 1 to the corresponding bits in EVTOMCUFLAGSCLR.</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC_IRQ</name>
                     <description>ADC_IRQ</description>
                     <bitRange>[10:10]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>OBSMUX0</name>
                     <description>OBSMUX0</description>
                     <bitRange>[9:9]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>ADC_FIFO_ALMOST_FULL</name>
                     <description>ADC_FIFO_ALMOST_FULL</description>
                     <bitRange>[8:8]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[7:7]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>SMPH_AUTOTAKE_DONE</name>
                     <description>SMPH_AUTOTAKE_DONE</description>
                     <bitRange>[6:6]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[5:5]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[4:4]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>AON_WU_EV</name>
                     <description>AON_WU_EV</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>COMBEVTOMCUMASK</name>
               <description>Combined Event To MCU Domain Mask

Selects which of the flags In EVTOMCUFLAGS that contribute to the AUX_COMB event to the MCU domain

The AUX_COMB event is asserted as long as one or more of the included event flags are set.</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADC_IRQ</name>
                     <description>ADC_IRQ</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>OBSMUX0</name>
                     <description>OBSMUX0</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>ADC_FIFO_ALMOST_FULL</name>
                     <description>ADC_FIFO_ALMOST_FULL</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>ADC_DONE</name>
                     <description>ADC_DONE</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SMPH_AUTOTAKE_DONE</name>
                     <description>SMPH_AUTOTAKE_DONE</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TIMER1_EV</name>
                     <description>TIMER1_EV</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TIMER0_EV</name>
                     <description>TIMER0_EV</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TDC_DONE</name>
                     <description>TDC_DONE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPB</name>
                     <description>AUX_COMPB</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AUX_COMPA</name>
                     <description>AUX_COMPA</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AON_WU_EV</name>
                     <description>AON_WU_EV</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VECFLAGS</name>
               <description>Vector Flags

