cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>AUX_TIMER</name>
         <description>AUX Timer

</description>
         <baseAddress>0x400c7000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>T0CFG</name>
               <description>Timer 0 Configuration
</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TICK_SRC_POL</name>
                     <description>TICK_SRC_POL</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>TICK_SRC</name>
                     <description>TICK_SRC</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>PRE</name>
                     <description>PRE</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>MODE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>T1CFG</name>
               <description>Timer 1 Configuration
</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TICK_SRC_POL</name>
                     <description>TICK_SRC_POL</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>TICK_SRC</name>
                     <description>TICK_SRC</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>PRE</name>
                     <description>PRE</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>MODE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RELOAD</name>
                     <description>RELOAD</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>T0CTL</name>
               <description>Timer 0 Control

Run control/status for timer 0
</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>T0TARGET</name>
               <description>Timer 0 Target

Target counter value for timer 0
</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>T1TARGET</name>
               <description>Timer 1 Target

Target Counter Value Timer 1
</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>T1CTL</name>
               <description>Timer 1 Control

Run Control/Status For Timer 1
</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>AUX_WUC</name>
         <description>AUX Wake-up controller  </description>
         <baseAddress>0x400c6000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>4096</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MODCLKEN0</name>
               <description>Module Clock Enable

Clock enable for each module in the AUX domain

For use by the system CPU

The settings in this register are OR'ed with the corresponding settings in MODCLKEN1. This allows the system CPU and AUX_SCE to request clocks independently. Settings take effect immediately.</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AUX_ADI4</name>
                     <description>AUX_ADI4</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>AUX_DDI0_OSC</name>
                     <description>AUX_DDI0_OSC</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TDC</name>
                     <description>TDC</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>ANAIF</name>
                     <description>ANAIF</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TIMER</name>
                     <description>TIMER</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>AIODIO1</name>
                     <description>AIODIO1</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AIODIO0</name>
                     <description>AIODIO0</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SMPH</name>
                     <description>SMPH</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWROFFREQ</name>
               <description>Power Off Request

