cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
Requests power off request for the AUX domain. When powered of the power supply and clock is disabled. This may only be used when taking the entire device into shutdown mode (i.e. with full device reset when resuming operation).

Power off is prevented if AON_WUC:AUXCTL.AUX_FORCE_ON has been set, or if MCUBUSCTL.DISCONNECT_REQ has been cleared.</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REQ</name>
                     <description>REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRDWNREQ</name>
               <description>Power Down Request

Request from AUX for system to enter power down. When system is in power down there is limited current supply available and the clock source is set by AON_WUC:AUXCLK.PWR_DWN_SRC</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REQ</name>
                     <description>REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRDWNACK</name>
               <description>Power Down Acknowledgment</description>
               <addressOffset>12</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKLFREQ</name>
               <description>Low Frequency Clock Request</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>REQ</name>
                     <description>REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKLFACK</name>
               <description>Low Frequency Clock Acknowledgment</description>
               <addressOffset>20</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>WUEVFLAGS</name>
               <description>Wake-up Event Flags

Status of wake-up events from the AON domain

The event flags are cleared by setting the corresponding bits in WUEVCLR
</description>
               <addressOffset>40</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AON_RTC_CH2</name>
                     <description>AON_RTC_CH2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AON_SW</name>
                     <description>AON_SW</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AON_PROG_WU</name>
                     <description>AON_PROG_WU</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>WUEVCLR</name>
               <description>Wake-up Event Clear

Clears wake-up events from the AON domain
</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AON_RTC_CH2</name>
                     <description>AON_RTC_CH2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>AON_SW</name>
                     <description>AON_SW</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>AON_PROG_WU</name>
                     <description>AON_PROG_WU</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCCLKCTL</name>
               <description>ADC Clock Control

Controls the ADC internal clock

Note that the ADC command and data interface requires MODCLKEN0.ANAIF or MODCLKEN1.ANAIF also to be set
</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>REQ</name>
                     <description>REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TDCCLKCTL</name>
               <description>TDC Clock Control

Controls the TDC counter clock source, which steps the TDC counter value

