cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
The source of this clock is controlled by OSC_DIG:CTL0.ACLK_TDC_SRC_SEL.
</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>REQ</name>
                     <description>REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>REFCLKCTL</name>
               <description>Reference Clock Control

Controls the TDC reference clock source, which is to be compared against the TDC counter clock. 

The source of this clock is controlled by OSC_DIG:CTL0.ACLK_REF_SRC_SEL.</description>
               <addressOffset>56</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>REQ</name>
                     <description>REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCSUBSECINC0</name>
               <description>Real Time Counter Sub Second Increment 0

New value for the real-time counter (AON_RTC) sub-second increment value, part corresponding to AON_RTC:SUBSECINC bits 15:0.

After setting INC15_0 and RTCSUBSECINC1.INC23_16, the value is loaded into AON_RTC:SUBSECINC.VALUEINC by setting RTCSUBSECINCCTL.UPD_REQ.
</description>
               <addressOffset>60</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INC15_0</name>
                     <description>INC15_0</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCSUBSECINC1</name>
               <description>Real Time Counter Sub Second Increment 1

New value for the real-time counter (AON_RTC) sub-second increment value, part corresponding to AON_RTC:SUBSECINC bits 23:16.

After setting RTCSUBSECINC0.INC15_0 and INC23_16, the value is loaded into AON_RTC:SUBSECINC.VALUEINC by setting RTCSUBSECINCCTL.UPD_REQ.</description>
               <addressOffset>64</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>INC23_16</name>
                     <description>INC23_16</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTCSUBSECINCCTL</name>
               <description>Real Time Counter Sub Second Increment Control</description>
               <addressOffset>68</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>UPD_ACK</name>
                     <description>UPD_ACK</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>UPD_REQ</name>
                     <description>UPD_REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCUBUSCTL</name>
               <description>MCU Bus Control

Controls the connection between the AUX domain bus and the MCU domain bus.

The buses must be disconnected to allow power-down or power-off of the AUX domain.
</description>
               <addressOffset>72</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DISCONNECT_REQ</name>
                     <description>DISCONNECT_REQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCUBUSSTAT</name>
               <description>MCU Bus Status

Indicates the connection state of the AUX domain and MCU domain buses.

Note that this register cannot be read from the MCU domain while disconnected, and is therefore only useful for the AUX_SCE.</description>
               <addressOffset>76</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DISCONNECTED</name>
                     <description>DISCONNECTED</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DISCONNECT_ACK</name>
                     <description>DISCONNECT_ACK</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AONCTLSTAT</name>
               <description>AON Domain Control Status

Status of AUX domain control from AON_WUC.</description>
               <addressOffset>80</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AUX_FORCE_ON</name>
                     <description>AUX_FORCE_ON</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SCE_RUN_EN</name>
                     <description>SCE_RUN_EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXIOLATCH</name>
               <description>AUX Input Output Latch

