cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>CCFG_PROT_31_0</name>
               <description>Protect Sectors 0-31
Each bit write protects one 4KB flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect.</description>
               <addressOffset>4080</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>WRT_PROT_SEC_31</name>
                     <description>WRT_PROT_SEC_31</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_30</name>
                     <description>WRT_PROT_SEC_30</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_29</name>
                     <description>WRT_PROT_SEC_29</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_28</name>
                     <description>WRT_PROT_SEC_28</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_27</name>
                     <description>WRT_PROT_SEC_27</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_26</name>
                     <description>WRT_PROT_SEC_26</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_25</name>
                     <description>WRT_PROT_SEC_25</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_24</name>
                     <description>WRT_PROT_SEC_24</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_23</name>
                     <description>WRT_PROT_SEC_23</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_22</name>
                     <description>WRT_PROT_SEC_22</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_21</name>
                     <description>WRT_PROT_SEC_21</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_20</name>
                     <description>WRT_PROT_SEC_20</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_19</name>
                     <description>WRT_PROT_SEC_19</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_18</name>
                     <description>WRT_PROT_SEC_18</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_17</name>
                     <description>WRT_PROT_SEC_17</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_16</name>
                     <description>WRT_PROT_SEC_16</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_15</name>
                     <description>WRT_PROT_SEC_15</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_14</name>
                     <description>WRT_PROT_SEC_14</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_13</name>
                     <description>WRT_PROT_SEC_13</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_12</name>
                     <description>WRT_PROT_SEC_12</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_11</name>
                     <description>WRT_PROT_SEC_11</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_10</name>
                     <description>WRT_PROT_SEC_10</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_9</name>
                     <description>WRT_PROT_SEC_9</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_8</name>
                     <description>WRT_PROT_SEC_8</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_7</name>
                     <description>WRT_PROT_SEC_7</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_6</name>
                     <description>WRT_PROT_SEC_6</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_5</name>
                     <description>WRT_PROT_SEC_5</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_4</name>
                     <description>WRT_PROT_SEC_4</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_3</name>
                     <description>WRT_PROT_SEC_3</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_2</name>
                     <description>WRT_PROT_SEC_2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_1</name>
                     <description>WRT_PROT_SEC_1</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_0</name>
                     <description>WRT_PROT_SEC_0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_PROT_63_32</name>
               <description>Protect Sectors 32-63
Each bit write protects one 4KB flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26xx and CC13xx.</description>
               <addressOffset>4084</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>WRT_PROT_SEC_63</name>
                     <description>WRT_PROT_SEC_63</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_62</name>
                     <description>WRT_PROT_SEC_62</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_61</name>
                     <description>WRT_PROT_SEC_61</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_60</name>
                     <description>WRT_PROT_SEC_60</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_59</name>
                     <description>WRT_PROT_SEC_59</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_58</name>
                     <description>WRT_PROT_SEC_58</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_57</name>
                     <description>WRT_PROT_SEC_57</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_56</name>
                     <description>WRT_PROT_SEC_56</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_55</name>
                     <description>WRT_PROT_SEC_55</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_54</name>
                     <description>WRT_PROT_SEC_54</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_53</name>
                     <description>WRT_PROT_SEC_53</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_52</name>
                     <description>WRT_PROT_SEC_52</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_51</name>
                     <description>WRT_PROT_SEC_51</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_50</name>
                     <description>WRT_PROT_SEC_50</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_49</name>
                     <description>WRT_PROT_SEC_49</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_48</name>
                     <description>WRT_PROT_SEC_48</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_47</name>
                     <description>WRT_PROT_SEC_47</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_46</name>
                     <description>WRT_PROT_SEC_46</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_45</name>
                     <description>WRT_PROT_SEC_45</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_44</name>
                     <description>WRT_PROT_SEC_44</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_43</name>
                     <description>WRT_PROT_SEC_43</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_42</name>
                     <description>WRT_PROT_SEC_42</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_41</name>
                     <description>WRT_PROT_SEC_41</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_40</name>
                     <description>WRT_PROT_SEC_40</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_39</name>
                     <description>WRT_PROT_SEC_39</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_38</name>
                     <description>WRT_PROT_SEC_38</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_37</name>
                     <description>WRT_PROT_SEC_37</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_36</name>
                     <description>WRT_PROT_SEC_36</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_35</name>
                     <description>WRT_PROT_SEC_35</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_34</name>
                     <description>WRT_PROT_SEC_34</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_33</name>
                     <description>WRT_PROT_SEC_33</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_32</name>
                     <description>WRT_PROT_SEC_32</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCFG_PROT_95_64</name>
               <description>Protect Sectors 64-95
Each bit write protects one flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use by CC26xx and CC13xx.</description>
               <addressOffset>4088</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>WRT_PROT_SEC_95</name>
                     <description>WRT_PROT_SEC_95</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_94</name>
                     <description>WRT_PROT_SEC_94</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_93</name>
                     <description>WRT_PROT_SEC_93</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_92</name>
                     <description>WRT_PROT_SEC_92</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_91</name>
                     <description>WRT_PROT_SEC_91</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_90</name>
                     <description>WRT_PROT_SEC_90</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_89</name>
                     <description>WRT_PROT_SEC_89</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_88</name>
                     <description>WRT_PROT_SEC_88</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_87</name>
                     <description>WRT_PROT_SEC_87</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_86</name>
                     <description>WRT_PROT_SEC_86</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_85</name>
                     <description>WRT_PROT_SEC_85</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_84</name>
                     <description>WRT_PROT_SEC_84</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_83</name>
                     <description>WRT_PROT_SEC_83</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_82</name>
                     <description>WRT_PROT_SEC_82</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_81</name>
                     <description>WRT_PROT_SEC_81</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_80</name>
                     <description>WRT_PROT_SEC_80</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_79</name>
                     <description>WRT_PROT_SEC_79</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_78</name>
                     <description>WRT_PROT_SEC_78</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_77</name>
                     <description>WRT_PROT_SEC_77</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_76</name>
                     <description>WRT_PROT_SEC_76</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_75</name>
                     <description>WRT_PROT_SEC_75</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_74</name>
                     <description>WRT_PROT_SEC_74</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_73</name>
                     <description>WRT_PROT_SEC_73</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_72</name>
                     <description>WRT_PROT_SEC_72</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_71</name>
                     <description>WRT_PROT_SEC_71</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_70</name>
                     <description>WRT_PROT_SEC_70</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_69</name>
                     <description>WRT_PROT_SEC_69</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_68</name>
                     <description>WRT_PROT_SEC_68</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_67</name>
                     <description>WRT_PROT_SEC_67</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_66</name>
                     <description>WRT_PROT_SEC_66</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_65</name>
                     <description>WRT_PROT_SEC_65</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>WRT_PROT_SEC_64</name>
                     <description>WRT_PROT_SEC_64</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
