cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>AESDATAOUT0</name>
               <description>Data Input/Output</description>
               <addressOffset>1376</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>AESDATAIN0</alternateRegister></register>
            <register>
               <name>AESDATAIN0</name>
               <description>AES Data Input/Output 0</description>
               <addressOffset>1376</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESDATAOUT1</name>
               <description>AES Data Input/Output 3</description>
               <addressOffset>1380</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>AESDATAIN1</alternateRegister></register>
            <register>
               <name>AESDATAIN1</name>
               <description>AES Data Input/Output 1</description>
               <addressOffset>1380</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESDATAOUT2</name>
               <description>AES Data Input/Output 2</description>
               <addressOffset>1384</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>AESDATAIN2</alternateRegister></register>
            <register>
               <name>AESDATAIN2</name>
               <description>AES Data Input/Output 2</description>
               <addressOffset>1384</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESDATAOUT3</name>
               <description>AES Data Input/Output 3</description>
               <addressOffset>1388</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>AESDATAIN3</alternateRegister></register>
            <register>
               <name>AESDATAIN3</name>
               <description>Data Input/Output</description>
               <addressOffset>1388</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0-3</dimIndex>
               <name>AESTAGOUT%s</name>
               <description>AES Tag Output</description>
               <addressOffset>1392</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAG</name>
                     <description>TAG</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALGSEL</name>
               <description>Master Algorithm Select
This register configures the internal destination of the DMA controller.</description>
               <addressOffset>1792</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TAG</name>
                     <description>TAG</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>AES</name>
                     <description>AES</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>KEY_STORE</name>
                     <description>KEY_STORE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DMAPROTCTL</name>
               <description>Master Protection Control</description>
               <addressOffset>1796</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>EN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWRESET</name>
               <description>Software Reset</description>
               <addressOffset>1856</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RESET</name>
                     <description>RESET</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQTYPE</name>
               <description>Interrupt Configuration</description>
               <addressOffset>1920</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IEN</name>
                     <description>IEN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQEN</name>
               <description>Interrupt Enable</description>
               <addressOffset>1924</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_IN_DONE</name>
                     <description>DMA_IN_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RESULT_AVAIL</name>
                     <description>RESULT_AVAIL</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQCLR</name>
               <description>Interrupt Clear</description>
               <addressOffset>1928</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_BUS_ERR</name>
                     <description>DMA_BUS_ERR</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>KEY_ST_WR_ERR</name>
                     <description>KEY_ST_WR_ERR</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>KEY_ST_RD_ERR</name>
                     <description>KEY_ST_RD_ERR</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>DMA_IN_DONE</name>
                     <description>DMA_IN_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RESULT_AVAIL</name>
                     <description>RESULT_AVAIL</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQSET</name>
               <description>Interrupt Set</description>
               <addressOffset>1932</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_IN_DONE</name>
                     <description>DMA_IN_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RESULT_AVAIL</name>
                     <description>RESULT_AVAIL</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IRQSTAT</name>
               <description>Interrupt Status</description>
               <addressOffset>1936</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMA_BUS_ERR</name>
                     <description>DMA_BUS_ERR</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>KEY_ST_WR_ERR</name>
                     <description>KEY_ST_WR_ERR</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>KEY_ST_RD_ERR</name>
                     <description>KEY_ST_RD_ERR</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>DMA_IN_DONE</name>
                     <description>DMA_IN_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RESULT_AVAIL</name>
                     <description>RESULT_AVAIL</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>HWVER</name>
               <description>CTRL Module Version</description>
               <addressOffset>2044</addressOffset>
               <access>read-only</access>
               <resetValue>0x91118778</resetValue>
               <fields>
                  <field>
                     <name>HW_MAJOR_VER</name>
                     <description>HW_MAJOR_VER</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>HW_MINOR_VER</name>
                     <description>HW_MINOR_VER</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>HW_PATCH_LVL</name>
                     <description>HW_PATCH_LVL</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>VER_NUM_COMPL</name>
                     <description>VER_NUM_COMPL</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VER_NUM</name>
                     <description>VER_NUM</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
