cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>RFCSEL3</name>
               <description>Output Selection for RFC Event 3</description>
               <addressOffset>268</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCSEL4</name>
               <description>Output Selection for RFC Event 4</description>
               <addressOffset>272</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000041</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCSEL5</name>
               <description>Output Selection for RFC Event 5</description>
               <addressOffset>276</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000042</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCSEL6</name>
               <description>Output Selection for RFC Event 6</description>
               <addressOffset>280</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000043</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCSEL7</name>
               <description>Output Selection for RFC Event 7</description>
               <addressOffset>284</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000044</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCSEL8</name>
               <description>Output Selection for RFC Event 8</description>
               <addressOffset>288</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000077</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCSEL9</name>
               <description>Output Selection for RFC Event 9</description>
               <addressOffset>292</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT0ACAPTSEL</name>
               <description>Output Selection for GPT0 0</description>
               <addressOffset>512</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000055</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT0BCAPTSEL</name>
               <description>Output Selection for GPT0 1</description>
               <addressOffset>516</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000056</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT1ACAPTSEL</name>
               <description>Output Selection for GPT1 0</description>
               <addressOffset>768</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000057</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT1BCAPTSEL</name>
               <description>Output Selection for GPT1 1</description>
               <addressOffset>772</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000058</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT2ACAPTSEL</name>
               <description>Output Selection for GPT2 0</description>
               <addressOffset>1024</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000059</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPT2BCAPTSEL</name>
               <description>Output Selection for GPT2 1</description>
               <addressOffset>1028</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000005a</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH1SSEL</name>
               <description>Output Selection for DMA Channel 1 SREQ</description>
               <addressOffset>1288</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000031</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH1BSEL</name>
               <description>Output Selection for DMA Channel 1 REQ</description>
               <addressOffset>1292</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000030</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH2SSEL</name>
               <description>Output Selection for DMA Channel 2 SREQ</description>
               <addressOffset>1296</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000033</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH2BSEL</name>
               <description>Output Selection for DMA Channel 2 REQ</description>
               <addressOffset>1300</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000032</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH3SSEL</name>
               <description>Output Selection for DMA Channel 3 SREQ

</description>
               <addressOffset>1304</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000029</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH3BSEL</name>
               <description>Output Selection for DMA Channel 3 REQ

</description>
               <addressOffset>1308</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000028</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH4SSEL</name>
               <description>Output Selection for DMA Channel 4 SREQ

</description>
               <addressOffset>1312</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000002b</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH4BSEL</name>
               <description>Output Selection for DMA Channel 4 REQ

</description>
               <addressOffset>1316</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000002a</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH5SSEL</name>
               <description>Output Selection for DMA Channel 5 SREQ</description>
               <addressOffset>1320</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000003a</resetValue>
               <fields>
               </fields>
            </register>
            <register>
               <name>UDMACH5BSEL</name>
               <description>Output Selection for DMA Channel 5 REQ</description>
               <addressOffset>1324</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000039</resetValue>
               <fields>
               </fields>
            </register>
            <register>
               <name>UDMACH6SSEL</name>
               <description>Output Selection for DMA Channel 6 SREQ</description>
               <addressOffset>1328</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000003c</resetValue>
               <fields>
               </fields>
            </register>
            <register>
               <name>UDMACH6BSEL</name>
               <description>Output Selection for DMA Channel 6 REQ</description>
               <addressOffset>1332</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000003b</resetValue>
               <fields>
               </fields>
            </register>
            <register>
               <name>UDMACH7SSEL</name>
               <description>Output Selection for DMA Channel 7 SREQ

</description>
               <addressOffset>1336</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000075</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH7BSEL</name>
               <description>Output Selection for DMA Channel 7 REQ

</description>
               <addressOffset>1340</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000076</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH8SSEL</name>
               <description>Output Selection for DMA Channel 8 SREQ

Single request is ignored for this channel</description>
               <addressOffset>1344</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000074</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH8BSEL</name>
               <description>Output Selection for DMA Channel 8 REQ

</description>
               <addressOffset>1348</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000074</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH9SSEL</name>
               <description>Output Selection for DMA Channel 9 SREQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMAARIS

</description>
               <addressOffset>1352</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000045</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH9BSEL</name>
               <description>Output Selection for DMA Channel 9 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMAARIS

</description>
               <addressOffset>1356</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000004d</resetValue>
               <fields>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDMACH10SSEL</name>
               <description>Output Selection for DMA Channel 10 SREQ

