cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>FCFG1</name>
         <description>Factory configuration area (FCFG1)</description>
         <baseAddress>0x50001000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MISC_CONF_1</name>
               <description>Misc configurations</description>
               <addressOffset>160</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffff00</resetValue>
               <fields>
                  <field>
                     <name>DEVICE_MINOR_REV</name>
                     <description>DEVICE_MINOR_REV</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAW_MEAS_5</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>176</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAW_D5</name>
                     <description>BAW_D5</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>BAW_T5</name>
                     <description>BAW_T5</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BAW_DT5</name>
                     <description>BAW_DT5</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAW_MEAS_4</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>180</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAW_D4</name>
                     <description>BAW_D4</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>BAW_T4</name>
                     <description>BAW_T4</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BAW_DT4</name>
                     <description>BAW_DT4</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAW_MEAS_3</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>184</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAW_D3</name>
                     <description>BAW_D3</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>BAW_T3</name>
                     <description>BAW_T3</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BAW_DT3</name>
                     <description>BAW_DT3</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAW_MEAS_2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>188</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAW_D2</name>
                     <description>BAW_D2</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>BAW_T2</name>
                     <description>BAW_T2</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BAW_DT2</name>
                     <description>BAW_DT2</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>BAW_MEAS_1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>192</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BAW_D1</name>
                     <description>BAW_D1</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>BAW_T1</name>
                     <description>BAW_T1</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BAW_DT1</name>
                     <description>BAW_DT1</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND_DIV5</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>196</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND_DIV6</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>200</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND_DIV10</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>204</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND_DIV12</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>208</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND_DIV15</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>212</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND_DIV30</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>216</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_SYNTH_DIV5</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>220</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_SYNTH_DIV6</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>224</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_SYNTH_DIV10</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>228</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_SYNTH_DIV12</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>232</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_SYNTH_DIV15</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>236</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_SYNTH_DIV30</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>240</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_MISC_ADC_DIV5</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>244</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_MISC_ADC_DIV6</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>248</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_MISC_ADC_DIV10</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>252</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
