cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>CONFIG_MISC_ADC_DIV12</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>256</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_MISC_ADC_DIV15</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>260</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_MISC_ADC_DIV30</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>264</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_DIE_ID_0</name>
               <description>Shadow of DIE_ID_0 register in eFuse</description>
               <addressOffset>280</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID_31_0</name>
                     <description>ID_31_0</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_DIE_ID_1</name>
               <description>Shadow of DIE_ID_1 register in eFuse</description>
               <addressOffset>284</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID_63_32</name>
                     <description>ID_63_32</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_DIE_ID_2</name>
               <description>Shadow of DIE_ID_2 register in eFuse</description>
               <addressOffset>288</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID_95_64</name>
                     <description>ID_95_64</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_DIE_ID_3</name>
               <description>Shadow of DIE_ID_3 register in eFuse</description>
               <addressOffset>292</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID_127_96</name>
                     <description>ID_127_96</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_OSC_BIAS_LDO_TRIM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>312</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SET_RCOSC_HF_COARSE_RESISTOR</name>
                     <description>SET_RCOSC_HF_COARSE_RESISTOR</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>TRIMMAG</name>
                     <description>TRIMMAG</description>
                     <bitRange>[26:23]</bitRange>
                  </field>
                  <field>
                     <name>TRIMIREF</name>
                     <description>TRIMIREF</description>
                     <bitRange>[22:18]</bitRange>
                  </field>
                  <field>
                     <name>ITRIM_DIG_LDO</name>
                     <description>ITRIM_DIG_LDO</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>VTRIM_DIG</name>
                     <description>VTRIM_DIG</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>VTRIM_COARSE</name>
                     <description>VTRIM_COARSE</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCHF_CTRIM</name>
                     <description>RCOSCHF_CTRIM</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDW_ANA_TRIM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>316</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BOD_BANDGAP_TRIM_CNF</name>
                     <description>BOD_BANDGAP_TRIM_CNF</description>
                     <bitRange>[26:25]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_ENABLE_PG1</name>
                     <description>VDDR_ENABLE_PG1</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_OK_HYS</name>
                     <description>VDDR_OK_HYS</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>IPTAT_TRIM</name>
                     <description>IPTAT_TRIM</description>
                     <bitRange>[22:21]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_TRIM</name>
                     <description>VDDR_TRIM</description>
                     <bitRange>[20:16]</bitRange>
                  </field>
                  <field>
                     <name>TRIMBOD_INTMODE</name>
                     <description>TRIMBOD_INTMODE</description>
                     <bitRange>[15:11]</bitRange>
                  </field>
                  <field>
                     <name>TRIMBOD_EXTMODE</name>
                     <description>TRIMBOD_EXTMODE</description>
                     <bitRange>[10:6]</bitRange>
                  </field>
                  <field>
                     <name>TRIMTEMP</name>
                     <description>TRIMTEMP</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_NUMBER</name>
               <description></description>
               <addressOffset>356</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOT_NUMBER</name>
                     <description>LOT_NUMBER</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_COORDINATE</name>
               <description></description>
               <addressOffset>364</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>XCOORDINATE</name>
                     <description>XCOORDINATE</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>YCOORDINATE</name>
                     <description>YCOORDINATE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_E_P</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>368</addressOffset>
               <access>read-only</access>
               <resetValue>0x17331a33</resetValue>
               <fields>
                  <field>
                     <name>PSU</name>
                     <description>PSU</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>ESU</name>
                     <description>ESU</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>PVSU</name>
                     <description>PVSU</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>EVSU</name>
                     <description>EVSU</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_C_E_P_R</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>372</addressOffset>
               <access>read-only</access>
               <resetValue>0x0a0a2000</resetValue>
               <fields>
                  <field>
                     <name>RVSU</name>
                     <description>RVSU</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>PV_ACCESS</name>
                     <description>PV_ACCESS</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>A_EXEZ_SETUP</name>
                     <description>A_EXEZ_SETUP</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>CVSU</name>
                     <description>CVSU</description>
                     <bitRange>[11:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_P_R_PV</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>376</addressOffset>
               <access>read-only</access>
               <resetValue>0x026e0200</resetValue>
               <fields>
                  <field>
                     <name>PH</name>
                     <description>PH</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>RH</name>
                     <description>RH</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>PVH</name>
                     <description>PVH</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>PVH2</name>
                     <description>PVH2</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_EH_SEQ</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>380</addressOffset>
               <access>read-only</access>
               <resetValue>0x0200f000</resetValue>
               <fields>
                  <field>
                     <name>EH</name>
                     <description>EH</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>SEQ</name>
                     <description>SEQ</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>VSTAT</name>
                     <description>VSTAT</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>SM_FREQUENCY</name>
                     <description>SM_FREQUENCY</description>
                     <bitRange>[11:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_VHV_E</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>384</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>VHV_E_START</name>
                     <description>VHV_E_START</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>VHV_E_STEP_HIGHT</name>
                     <description>VHV_E_STEP_HIGHT</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_PP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>388</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000014</resetValue>
               <fields>
                  <field>
                     <name>PUMP_SU</name>
                     <description>PUMP_SU</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>MAX_PP</name>
                     <description>MAX_PP</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_PROG_EP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>392</addressOffset>
               <access>read-only</access>
               <resetValue>0x0fa00010</resetValue>
               <fields>
                  <field>
                     <name>MAX_EP</name>
                     <description>MAX_EP</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>PROGRAM_PW</name>
                     <description>PROGRAM_PW</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_ERA_PW</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>396</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000fa0</resetValue>
               <fields>
                  <field>
                     <name>ERASE_PW</name>
                     <description>ERASE_PW</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_VHV</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>400</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>TRIM13_P</name>
                     <description>TRIM13_P</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>VHV_P</name>
                     <description>VHV_P</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>TRIM13_E</name>
                     <description>TRIM13_E</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>VHV_E</name>
                     <description>VHV_E</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_VHV_PV</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>404</addressOffset>
               <access>read-only</access>
               <resetValue>0x00080001</resetValue>
               <fields>
                  <field>
                     <name>TRIM13_PV</name>
                     <description>TRIM13_PV</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>VHV_PV</name>
                     <description>VHV_PV</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>VCG2P5</name>
                     <description>VCG2P5</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VINH</name>
                     <description>VINH</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_V</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>408</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VSL_P</name>
                     <description>VSL_P</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>VWL_P</name>
                     <description>VWL_P</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>V_READ</name>
                     <description>V_READ</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>USER_ID</name>
               <description>User Identification.
Reading this register or the ICEPICK_DEVICE_ID register is the only support way of identifying a device.
The value of this register will be written to AON_WUC:JTAGUSERCODE by boot FW while in safezone.</description>
               <addressOffset>660</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PG_REV</name>
                     <description>PG_REV</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>VER</name>
                     <description>VER</description>
                     <bitRange>[27:26]</bitRange>
                  </field>
                  <field>
                     <name>SEQUENCE</name>
                     <description>SEQUENCE</description>
                     <bitRange>[22:19]</bitRange>
                  </field>
                  <field>
                     <name>PKG</name>
                     <description>PKG</description>
                     <bitRange>[18:16]</bitRange>
                  </field>
                  <field>
                     <name>PROTOCOL</name>
                     <description>PROTOCOL</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
               </fields>
            </register>
