cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>FLASH_OTP_DATA3</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>688</addressOffset>
               <access>read-only</access>
               <resetValue>0x00110003</resetValue>
               <fields>
                  <field>
                     <name>EC_STEP_SIZE</name>
                     <description>EC_STEP_SIZE</description>
                     <bitRange>[31:23]</bitRange>
                  </field>
                  <field>
                     <name>DO_PRECOND</name>
                     <description>DO_PRECOND</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>MAX_EC_LEVEL</name>
                     <description>MAX_EC_LEVEL</description>
                     <bitRange>[21:18]</bitRange>
                  </field>
                  <field>
                     <name>TRIM_1P7</name>
                     <description>TRIM_1P7</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>FLASH_SIZE</name>
                     <description>FLASH_SIZE</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>WAIT_SYSCODE</name>
                     <description>WAIT_SYSCODE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANA2_TRIM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>692</addressOffset>
               <access>read-only</access>
               <resetValue>0x8240f47f</resetValue>
               <fields>
                  <field>
                     <name>RCOSCHFCTRIMFRACT_EN</name>
                     <description>RCOSCHFCTRIMFRACT_EN</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCHFCTRIMFRACT</name>
                     <description>RCOSCHFCTRIMFRACT</description>
                     <bitRange>[30:26]</bitRange>
                  </field>
                  <field>
                     <name>SET_RCOSC_HF_FINE_RESISTOR</name>
                     <description>SET_RCOSC_HF_FINE_RESISTOR</description>
                     <bitRange>[24:23]</bitRange>
                  </field>
                  <field>
                     <name>ATESTLF_UDIGLDO_IBIAS_TRIM</name>
                     <description>ATESTLF_UDIGLDO_IBIAS_TRIM</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>NANOAMP_RES_TRIM</name>
                     <description>NANOAMP_RES_TRIM</description>
                     <bitRange>[21:16]</bitRange>
                  </field>
                  <field>
                     <name>DITHER_EN</name>
                     <description>DITHER_EN</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>DCDC_IPEAK</name>
                     <description>DCDC_IPEAK</description>
                     <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                     <name>DEAD_TIME_TRIM</name>
                     <description>DEAD_TIME_TRIM</description>
                     <bitRange>[7:6]</bitRange>
                  </field>
                  <field>
                     <name>DCDC_LOW_EN_SEL</name>
                     <description>DCDC_LOW_EN_SEL</description>
                     <bitRange>[5:3]</bitRange>
                  </field>
                  <field>
                     <name>DCDC_HIGH_EN_SEL</name>
                     <description>DCDC_HIGH_EN_SEL</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>LDO_TRIM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>696</addressOffset>
               <access>read-only</access>
               <resetValue>0xe0f8e0fb</resetValue>
               <fields>
                  <field>
                     <name>VDDR_TRIM_SLEEP</name>
                     <description>VDDR_TRIM_SLEEP</description>
                     <bitRange>[28:24]</bitRange>
                  </field>
                  <field>
                     <name>GLDO_CURSRC</name>
                     <description>GLDO_CURSRC</description>
                     <bitRange>[18:16]</bitRange>
                  </field>
                  <field>
                     <name>ITRIM_DIGLDO_LOAD</name>
                     <description>ITRIM_DIGLDO_LOAD</description>
                     <bitRange>[12:11]</bitRange>
                  </field>
                  <field>
                     <name>ITRIM_UDIGLDO</name>
                     <description>ITRIM_UDIGLDO</description>
                     <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                     <name>VTRIM_DELTA</name>
                     <description>VTRIM_DELTA</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAC_BLE_0</name>
               <description>MAC BLE Address 0</description>
               <addressOffset>744</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_0_31</name>
                     <description>ADDR_0_31</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAC_BLE_1</name>
               <description>MAC BLE Address 1</description>
               <addressOffset>748</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_32_63</name>
                     <description>ADDR_32_63</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAC_15_4_0</name>
               <description>MAC IEEE 802.15.4 Address 0</description>
               <addressOffset>752</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_0_31</name>
                     <description>ADDR_0_31</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAC_15_4_1</name>
               <description>MAC IEEE 802.15.4 Address 1</description>
               <addressOffset>756</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR_32_63</name>
                     <description>ADDR_32_63</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLASH_OTP_DATA4</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>776</addressOffset>
               <access>read-only</access>
               <resetValue>0x98989f9f</resetValue>
               <fields>
                  <field>
                     <name>STANDBY_MODE_SEL_INT_WRT</name>
                     <description>STANDBY_MODE_SEL_INT_WRT</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_PW_SEL_INT_WRT</name>
                     <description>STANDBY_PW_SEL_INT_WRT</description>
                     <bitRange>[30:29]</bitRange>
                  </field>
                  <field>
                     <name>DIS_STANDBY_INT_WRT</name>
                     <description>DIS_STANDBY_INT_WRT</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>DIS_IDLE_INT_WRT</name>
                     <description>DIS_IDLE_INT_WRT</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>VIN_AT_X_INT_WRT</name>
                     <description>VIN_AT_X_INT_WRT</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_MODE_SEL_EXT_WRT</name>
                     <description>STANDBY_MODE_SEL_EXT_WRT</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_PW_SEL_EXT_WRT</name>
                     <description>STANDBY_PW_SEL_EXT_WRT</description>
                     <bitRange>[22:21]</bitRange>
                  </field>
                  <field>
                     <name>DIS_STANDBY_EXT_WRT</name>
                     <description>DIS_STANDBY_EXT_WRT</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>DIS_IDLE_EXT_WRT</name>
                     <description>DIS_IDLE_EXT_WRT</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>VIN_AT_X_EXT_WRT</name>
                     <description>VIN_AT_X_EXT_WRT</description>
                     <bitRange>[18:16]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_MODE_SEL_INT_RD</name>
                     <description>STANDBY_MODE_SEL_INT_RD</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_PW_SEL_INT_RD</name>
                     <description>STANDBY_PW_SEL_INT_RD</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>DIS_STANDBY_INT_RD</name>
                     <description>DIS_STANDBY_INT_RD</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>DIS_IDLE_INT_RD</name>
                     <description>DIS_IDLE_INT_RD</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>VIN_AT_X_INT_RD</name>
                     <description>VIN_AT_X_INT_RD</description>
                     <bitRange>[10:8]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_MODE_SEL_EXT_RD</name>
                     <description>STANDBY_MODE_SEL_EXT_RD</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>STANDBY_PW_SEL_EXT_RD</name>
                     <description>STANDBY_PW_SEL_EXT_RD</description>
                     <bitRange>[6:5]</bitRange>
                  </field>
                  <field>
                     <name>DIS_STANDBY_EXT_RD</name>
                     <description>DIS_STANDBY_EXT_RD</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>DIS_IDLE_EXT_RD</name>
                     <description>DIS_IDLE_EXT_RD</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>VIN_AT_X_EXT_RD</name>
                     <description>VIN_AT_X_EXT_RD</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISC_TRIM</name>
               <description>Miscellaneous Trim  Parameters</description>
               <addressOffset>780</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffff33</resetValue>
               <fields>
                  <field>
                     <name>TEMPVSLOPE</name>
                     <description>TEMPVSLOPE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RCOSC_HF_TEMPCOMP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>784</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>FINE_RESISTOR</name>
                     <description>FINE_RESISTOR</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>CTRIM</name>
                     <description>CTRIM</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>CTRIMFRACT_QUAD</name>
                     <description>CTRIMFRACT_QUAD</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>CTRIMFRACT_SLOPE</name>
                     <description>CTRIMFRACT_SLOPE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICEPICK_DEVICE_ID</name>
               <description>IcePick Device Identification
Reading this register or the USER_ID register is the only support way of identifying a device.</description>
               <addressOffset>792</addressOffset>
               <access>read-only</access>
               <resetValue>0x8b99a02f</resetValue>
               <fields>
                  <field>
                     <name>PG_REV</name>
                     <description>PG_REV</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>WAFER_ID</name>
                     <description>WAFER_ID</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>MANUFACTURER_ID</name>
                     <description>MANUFACTURER_ID</description>
                     <bitRange>[11:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG1_REVISION</name>
               <description>Factory Configuration (FCFG1) Revision</description>
               <addressOffset>796</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000023</resetValue>
               <fields>
                  <field>
                     <name>REV</name>
                     <description>REV</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISC_OTP_DATA</name>
               <description>Misc OTP Data</description>
               <addressOffset>800</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000c600</resetValue>
               <fields>
                  <field>
                     <name>RCOSC_HF_ITUNE</name>
                     <description>RCOSC_HF_ITUNE</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>RCOSC_HF_CRIM</name>
                     <description>RCOSC_HF_CRIM</description>
                     <bitRange>[27:20]</bitRange>
                  </field>
                  <field>
                     <name>PER_M</name>
                     <description>PER_M</description>
                     <bitRange>[19:15]</bitRange>
                  </field>
                  <field>
                     <name>PER_E</name>
                     <description>PER_E</description>
                     <bitRange>[14:12]</bitRange>
                  </field>
                  <field>
                     <name>PO_TAIL_RES_TRIM</name>
                     <description>PO_TAIL_RES_TRIM</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>TEST_PROGRAM_REV</name>
                     <description>TEST_PROGRAM_REV</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCONF</name>
               <description>IO Configuration</description>
               <addressOffset>836</addressOffset>
               <access>read-only</access>
               <resetValue>0x7fffff8000</resetValue>
               <fields>
                  <field>
                     <name>GPIO_CNT</name>
                     <description>GPIO_CNT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_IF_ADC</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>844</addressOffset>
               <access>read-only</access>
               <resetValue>0x3460f400</resetValue>
               <fields>
                  <field>
                     <name>FF2ADJ</name>
                     <description>FF2ADJ</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>FF3ADJ</name>
                     <description>FF3ADJ</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>INT3ADJ</name>
                     <description>INT3ADJ</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>FF1ADJ</name>
                     <description>FF1ADJ</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>AAFCAP</name>
                     <description>AAFCAP</description>
                     <bitRange>[15:14]</bitRange>
                  </field>
                  <field>
                     <name>INT2ADJ</name>
                     <description>INT2ADJ</description>
                     <bitRange>[13:10]</bitRange>
                  </field>
                  <field>
                     <name>IFDIGLDO_TRIM_OUTPUT</name>
                     <description>IFDIGLDO_TRIM_OUTPUT</description>
                     <bitRange>[9:5]</bitRange>
                  </field>
                  <field>
                     <name>IFANALDO_TRIM_OUTPUT</name>
                     <description>IFANALDO_TRIM_OUTPUT</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_OSC_TOP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>848</addressOffset>
               <access>read-only</access>
               <resetValue>0xfc00fc00</resetValue>
               <fields>
                  <field>
                     <name>XOSC_HF_ROW_Q12</name>
                     <description>XOSC_HF_ROW_Q12</description>
                     <bitRange>[29:26]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_COLUMN_Q12</name>
                     <description>XOSC_HF_COLUMN_Q12</description>
                     <bitRange>[25:10]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCLF_CTUNE_TRIM</name>
                     <description>RCOSCLF_CTUNE_TRIM</description>
                     <bitRange>[9:2]</bitRange>
                  </field>
                  <field>
                     <name>RCOSCLF_RTUNE_TRIM</name>
                     <description>RCOSCLF_RTUNE_TRIM</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_RF_FRONTEND</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>852</addressOffset>
               <access>read-only</access>
               <resetValue>0x70001f80</resetValue>
               <fields>
                  <field>
                     <name>IFAMP_IB</name>
                     <description>IFAMP_IB</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>LNA_IB</name>
                     <description>LNA_IB</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>IFAMP_TRIM</name>
                     <description>IFAMP_TRIM</description>
                     <bitRange>[23:19]</bitRange>
                  </field>
                  <field>
                     <name>CTL_PA0_TRIM</name>
                     <description>CTL_PA0_TRIM</description>
                     <bitRange>[18:14]</bitRange>
                  </field>
                  <field>
                     <name>PATRIMCOMPLETE_N</name>
                     <description>PATRIMCOMPLETE_N</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>RFLDO_TRIM_OUTPUT</name>
                     <description>RFLDO_TRIM_OUTPUT</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
