cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>CONFIG_SYNTH</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>856</addressOffset>
               <access>read-only</access>
               <resetValue>0xfffff000</resetValue>
               <fields>
                  <field>
                     <name>RFC_MDM_DEMIQMC0</name>
                     <description>RFC_MDM_DEMIQMC0</description>
                     <bitRange>[27:12]</bitRange>
                  </field>
                  <field>
                     <name>LDOVCO_TRIM_OUTPUT</name>
                     <description>LDOVCO_TRIM_OUTPUT</description>
                     <bitRange>[11:6]</bitRange>
                  </field>
                  <field>
                     <name>SLDO_TRIM_OUTPUT</name>
                     <description>SLDO_TRIM_OUTPUT</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOC_ADC_ABS_GAIN</name>
               <description>AUX_ADC Gain in Absolute Reference Mode</description>
               <addressOffset>860</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOC_ADC_ABS_GAIN_TEMP1</name>
                     <description>SOC_ADC_ABS_GAIN_TEMP1</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOC_ADC_REL_GAIN</name>
               <description>AUX_ADC Gain in Relative Reference Mode</description>
               <addressOffset>864</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOC_ADC_REL_GAIN_TEMP1</name>
                     <description>SOC_ADC_REL_GAIN_TEMP1</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOC_ADC_OFFSET_INT</name>
               <description>AUX_ADC Temperature Offsets in Absolute Reference Mode</description>
               <addressOffset>872</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SOC_ADC_REL_OFFSET_TEMP1</name>
                     <description>SOC_ADC_REL_OFFSET_TEMP1</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>SOC_ADC_ABS_OFFSET_TEMP1</name>
                     <description>SOC_ADC_ABS_OFFSET_TEMP1</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOC_ADC_REF_TRIM_AND_OFFSET_EXT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>876</addressOffset>
               <access>read-only</access>
               <resetValue>0x00300080</resetValue>
               <fields>
                  <field>
                     <name>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</name>
                     <description>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMPCOMP_TH1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>880</addressOffset>
               <access>read-only</access>
               <resetValue>0xff7b828e</resetValue>
               <fields>
                  <field>
                     <name>HPMRAMP3_LTH</name>
                     <description>HPMRAMP3_LTH</description>
                     <bitRange>[23:18]</bitRange>
                  </field>
                  <field>
                     <name>HPMRAMP3_HTH</name>
                     <description>HPMRAMP3_HTH</description>
                     <bitRange>[15:10]</bitRange>
                  </field>
                  <field>
                     <name>IBIASCAP_LPTOHP_OL_CNT</name>
                     <description>IBIASCAP_LPTOHP_OL_CNT</description>
                     <bitRange>[9:6]</bitRange>
                  </field>
                  <field>
                     <name>HPMRAMP1_TH</name>
                     <description>HPMRAMP1_TH</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMPCOMP_TH2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>884</addressOffset>
               <access>read-only</access>
               <resetValue>0x6b8b0303</resetValue>
               <fields>
                  <field>
                     <name>LPMUPDATE_LTH</name>
                     <description>LPMUPDATE_LTH</description>
                     <bitRange>[31:26]</bitRange>
                  </field>
                  <field>
                     <name>LPMUPDATE_HTM</name>
                     <description>LPMUPDATE_HTM</description>
                     <bitRange>[23:18]</bitRange>
                  </field>
                  <field>
                     <name>ADC_COMP_AMPTH_LPM</name>
                     <description>ADC_COMP_AMPTH_LPM</description>
                     <bitRange>[15:10]</bitRange>
                  </field>
                  <field>
                     <name>ADC_COMP_AMPTH_HPM</name>
                     <description>ADC_COMP_AMPTH_HPM</description>
                     <bitRange>[7:2]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>AMPCOMP_CTRL1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>888</addressOffset>
               <access>read-only</access>
               <resetValue>0xff183f47</resetValue>
               <fields>
                  <field>
                     <name>AMPCOMP_REQ_MODE</name>
                     <description>AMPCOMP_REQ_MODE</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IBIAS_OFFSET</name>
                     <description>IBIAS_OFFSET</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>IBIAS_INIT</name>
                     <description>IBIAS_INIT</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
                     <description>LPM_IBIAS_WAIT_CNT_FINAL</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>CAP_STEP</name>
                     <description>CAP_STEP</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>IBIASCAP_HPTOLP_OL_CNT</name>
                     <description>IBIASCAP_HPTOLP_OL_CNT</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ANABYPASS_VALUE2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>892</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffc3ff</resetValue>
               <fields>
                  <field>
                     <name>XOSC_HF_IBIASTHERM</name>
                     <description>XOSC_HF_IBIASTHERM</description>
                     <bitRange>[13:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG_MISC_ADC</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>896</addressOffset>
               <access>read-only</access>
               <resetValue>0xfffc014d</resetValue>
               <fields>
                  <field>
                     <name>RSSITRIMCOMPLETE_N</name>
                     <description>RSSITRIMCOMPLETE_N</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>RSSI_OFFSET</name>
                     <description>RSSI_OFFSET</description>
                     <bitRange>[16:9]</bitRange>
                  </field>
                  <field>
                     <name>QUANTCTLTHRES</name>
                     <description>QUANTCTLTHRES</description>
                     <bitRange>[8:6]</bitRange>
                  </field>
                  <field>
                     <name>DACTRIM</name>
                     <description>DACTRIM</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>VOLT_TRIM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>904</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffe0</resetValue>
               <fields>
                  <field>
                     <name>VDDR_TRIM_HH</name>
                     <description>VDDR_TRIM_HH</description>
                     <bitRange>[28:24]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_TRIM_H</name>
                     <description>VDDR_TRIM_H</description>
                     <bitRange>[20:16]</bitRange>
                  </field>
                  <field>
                     <name>VDDR_TRIM_SLEEP_H</name>
                     <description>VDDR_TRIM_SLEEP_H</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>TRIMBOD_H</name>
                     <description>TRIMBOD_H</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSC_CONF</name>
               <description>OSC Configuration</description>
               <addressOffset>908</addressOffset>
               <access>read-only</access>
               <resetValue>0xf0080000</resetValue>
               <fields>
                  <field>
                     <name>ADC_SH_VBUF_EN</name>
                     <description>ADC_SH_VBUF_EN</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>ADC_SH_MODE_EN</name>
                     <description>ADC_SH_MODE_EN</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>ATESTLF_RCOSCLF_IBIAS_TRIM</name>
                     <description>ATESTLF_RCOSCLF_IBIAS_TRIM</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>XOSCLF_REGULATOR_TRIM</name>
                     <description>XOSCLF_REGULATOR_TRIM</description>
                     <bitRange>[26:25]</bitRange>
                  </field>
                  <field>
                     <name>XOSCLF_CMIRRWR_RATIO</name>
                     <description>XOSCLF_CMIRRWR_RATIO</description>
                     <bitRange>[24:21]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_HF_FAST_START</name>
                     <description>XOSC_HF_FAST_START</description>
                     <bitRange>[20:19]</bitRange>
                  </field>
                  <field>
                     <name>XOSC_OPTION</name>
                     <description>XOSC_OPTION</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>BAW_OPTION</name>
                     <description>BAW_OPTION</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>BAW_BIAS_HOLD_MODE_EN</name>
                     <description>BAW_BIAS_HOLD_MODE_EN</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>BAW_CURRMIRR_RATIO</name>
                     <description>BAW_CURRMIRR_RATIO</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>BAW_BIAS_RES_SET</name>
                     <description>BAW_BIAS_RES_SET</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>BAW_FILTER_EN</name>
                     <description>BAW_FILTER_EN</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>BAW_BIAS_RECHARGE_DELAY</name>
                     <description>BAW_BIAS_RECHARGE_DELAY</description>
                     <bitRange>[6:5]</bitRange>
                  </field>
                  <field>
                     <name>BAW_SERIES_CAP</name>
                     <description>BAW_SERIES_CAP</description>
                     <bitRange>[2:1]</bitRange>
                  </field>
                  <field>
                     <name>BAW_DIV3_BYPASS</name>
                     <description>BAW_DIV3_BYPASS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAP_TRIM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>916</addressOffset>
               <access>read-only</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FLUX_CAP_0P28_TRIM</name>
                     <description>FLUX_CAP_0P28_TRIM</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>FLUX_CAP_0P4_TRIM</name>
                     <description>FLUX_CAP_0P4_TRIM</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISC_OTP_DATA_1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>920</addressOffset>
               <access>read-only</access>
               <resetValue>0xe00403f8</resetValue>
               <fields>
                  <field>
                     <name>PEAK_DET_ITRIM</name>
                     <description>PEAK_DET_ITRIM</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>HP_BUF_ITRIM</name>
                     <description>HP_BUF_ITRIM</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>LP_BUF_ITRIM</name>
                     <description>LP_BUF_ITRIM</description>
                     <bitRange>[23:22]</bitRange>
                  </field>
                  <field>
                     <name>DBLR_LOOP_FILTER_RESET_VOLTAGE</name>
                     <description>DBLR_LOOP_FILTER_RESET_VOLTAGE</description>
                     <bitRange>[21:20]</bitRange>
                  </field>
                  <field>
                     <name>HPM_IBIAS_WAIT_CNT</name>
                     <description>HPM_IBIAS_WAIT_CNT</description>
                     <bitRange>[19:10]</bitRange>
                  </field>
                  <field>
                     <name>LPM_IBIAS_WAIT_CNT</name>
                     <description>LPM_IBIAS_WAIT_CNT</description>
                     <bitRange>[9:4]</bitRange>
                  </field>
                  <field>
                     <name>IDAC_STEP</name>
                     <description>IDAC_STEP</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWD_CURR_20C</name>
               <description>Power Down Current Control 20C</description>
               <addressOffset>924</addressOffset>
               <access>read-only</access>
               <resetValue>0x080ba608</resetValue>
               <fields>
                  <field>
                     <name>DELTA_CACHE_REF</name>
                     <description>DELTA_CACHE_REF</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_RFMEM_RET</name>
                     <description>DELTA_RFMEM_RET</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_XOSC_LPM</name>
                     <description>DELTA_XOSC_LPM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BASELINE</name>
                     <description>BASELINE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWD_CURR_35C</name>
               <description>Power Down Current Control 35C</description>
               <addressOffset>928</addressOffset>
               <access>read-only</access>
               <resetValue>0x0c10a50a</resetValue>
               <fields>
                  <field>
                     <name>DELTA_CACHE_REF</name>
                     <description>DELTA_CACHE_REF</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_RFMEM_RET</name>
                     <description>DELTA_RFMEM_RET</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_XOSC_LPM</name>
                     <description>DELTA_XOSC_LPM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BASELINE</name>
                     <description>BASELINE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWD_CURR_50C</name>
               <description>Power Down Current Control 50C</description>
               <addressOffset>932</addressOffset>
               <access>read-only</access>
               <resetValue>0x1218a20d</resetValue>
               <fields>
                  <field>
                     <name>DELTA_CACHE_REF</name>
                     <description>DELTA_CACHE_REF</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_RFMEM_RET</name>
                     <description>DELTA_RFMEM_RET</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_XOSC_LPM</name>
                     <description>DELTA_XOSC_LPM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BASELINE</name>
                     <description>BASELINE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWD_CURR_65C</name>
               <description>Power Down Current Control 65C</description>
               <addressOffset>936</addressOffset>
               <access>read-only</access>
               <resetValue>0x1c259c14</resetValue>
               <fields>
                  <field>
                     <name>DELTA_CACHE_REF</name>
                     <description>DELTA_CACHE_REF</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_RFMEM_RET</name>
                     <description>DELTA_RFMEM_RET</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_XOSC_LPM</name>
                     <description>DELTA_XOSC_LPM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BASELINE</name>
                     <description>BASELINE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWD_CURR_80C</name>
               <description>Power Down Current Control 80C</description>
               <addressOffset>940</addressOffset>
               <access>read-only</access>
               <resetValue>0x2e3b9021</resetValue>
               <fields>
                  <field>
                     <name>DELTA_CACHE_REF</name>
                     <description>DELTA_CACHE_REF</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_RFMEM_RET</name>
                     <description>DELTA_RFMEM_RET</description>
                     <bitRange>[23:16]</bitRange>
                  </field>
                  <field>
                     <name>DELTA_XOSC_LPM</name>
                     <description>DELTA_XOSC_LPM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>BASELINE</name>
                     <description>BASELINE</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
