cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>EFUSEPINS</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4140</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EFC_SELF_TEST_DONE</name>
                     <description>EFC_SELF_TEST_DONE</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>EFC_SELF_TEST_ERROR</name>
                     <description>EFC_SELF_TEST_ERROR</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>SYS_ECC_SELF_TEST_EN</name>
                     <description>SYS_ECC_SELF_TEST_EN</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>EFC_INSTRUCTION_INFO</name>
                     <description>EFC_INSTRUCTION_INFO</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>EFC_INSTRUCTION_ERROR</name>
                     <description>EFC_INSTRUCTION_ERROR</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>EFC_AUTOLOAD_ERROR</name>
                     <description>EFC_AUTOLOAD_ERROR</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>SYS_ECC_OVERRIDE_EN</name>
                     <description>SYS_ECC_OVERRIDE_EN</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>EFC_READY</name>
                     <description>EFC_READY</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>EFC_FCLRZ</name>
                     <description>EFC_FCLRZ</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>SYS_DIEID_AUTOLOAD_EN</name>
                     <description>SYS_DIEID_AUTOLOAD_EN</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>SYS_REPAIR_EN</name>
                     <description>SYS_REPAIR_EN</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>SYS_WS_READ_STATES</name>
                     <description>SYS_WS_READ_STATES</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSECRA</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4144</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSEREAD</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4148</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATABIT</name>
                     <description>DATABIT</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>READCLOCK</name>
                     <description>READCLOCK</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>DEBUG</name>
                     <description>DEBUG</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>SPARE</name>
                     <description>SPARE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>MARGIN</name>
                     <description>MARGIN</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSEPROGRAM</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4152</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>COMPAREDISABLE</name>
                     <description>COMPAREDISABLE</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>CLOCKSTALL</name>
                     <description>CLOCKSTALL</description>
                     <bitRange>[29:14]</bitRange>
                  </field>
                  <field>
                     <name>VPPTOVDD</name>
                     <description>VPPTOVDD</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>ITERATIONS</name>
                     <description>ITERATIONS</description>
                     <bitRange>[12:9]</bitRange>
                  </field>
                  <field>
                     <name>WRITECLOCK</name>
                     <description>WRITECLOCK</description>
                     <bitRange>[8:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFUSEERROR</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4156</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>DONE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>CODE</name>
                     <description>CODE</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SINGLEBIT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4160</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FROMN</name>
                     <description>FROMN</description>
                     <bitRange>[31:1]</bitRange>
                  </field>
                  <field>
                     <name>FROM0</name>
                     <description>FROM0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TWOBIT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4164</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FROMN</name>
                     <description>FROMN</description>
                     <bitRange>[31:1]</bitRange>
                  </field>
                  <field>
                     <name>FROM0</name>
                     <description>FROM0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SELFTESTCYC</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4168</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CYCLES</name>
                     <description>CYCLES</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SELFTESTSIGN</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>4172</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SIGNATURE</name>
                     <description>SIGNATURE</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRDCTL</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8192</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>RWAIT</name>
                     <description>RWAIT</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSPRD</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8196</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RMBSEM</name>
                     <description>RMBSEM</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>RM1</name>
                     <description>RM1</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RM0</name>
                     <description>RM0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEDACCTL1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8200</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SUSP_IGNR</name>
                     <description>SUSP_IGNR</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEDACSTAT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8220</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RVF_INT</name>
                     <description>RVF_INT</description>
                     <bitRange>[25:25]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>FSM_DONE</name>
                     <description>FSM_DONE</description>
                     <bitRange>[24:24]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBPROT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8240</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PROTL1DIS</name>
                     <description>PROTL1DIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBSE</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8244</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BSE</name>
                     <description>BSE</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBBUSY</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8248</addressOffset>
               <access>read-only</access>
               <resetValue>0x000000fe</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBAC</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8252</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000000f</resetValue>
               <fields>
                  <field>
                     <name>OTPPROTDIS</name>
                     <description>OTPPROTDIS</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>BAGP</name>
                     <description>BAGP</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>VREADS</name>
                     <description>VREADS</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBFALLBACK</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8256</addressOffset>
               <access>read-write</access>
               <resetValue>0x0505ffff</resetValue>
               <fields>
                  <field>
                     <name>FSM_PWRSAV</name>
                     <description>FSM_PWRSAV</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>REG_PWRSAV</name>
                     <description>REG_PWRSAV</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR7</name>
                     <description>BANKPWR7</description>
                     <bitRange>[15:14]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR6</name>
                     <description>BANKPWR6</description>
                     <bitRange>[13:12]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR5</name>
                     <description>BANKPWR5</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR4</name>
                     <description>BANKPWR4</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR3</name>
                     <description>BANKPWR3</description>
                     <bitRange>[7:6]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR2</name>
                     <description>BANKPWR2</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR1</name>
                     <description>BANKPWR1</description>
                     <bitRange>[3:2]</bitRange>
                  </field>
                  <field>
                     <name>BANKPWR0</name>
                     <description>BANKPWR0</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBPRDY</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8260</addressOffset>
               <access>read-only</access>
               <resetValue>0x00ff00fe</resetValue>
               <fields>
                  <field>
                     <name>BANKBUSY</name>
                     <description>BANKBUSY</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>PUMPRDY</name>
                     <description>PUMPRDY</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>BANKRDY</name>
                     <description>BANKRDY</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPAC1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8264</addressOffset>
               <access>read-write</access>
               <resetValue>0x02082081</resetValue>
               <fields>
                  <field>
                     <name>PSLEEPTDIS</name>
                     <description>PSLEEPTDIS</description>
                     <bitRange>[27:16]</bitRange>
                  </field>
                  <field>
                     <name>PUMPRESET_PW</name>
                     <description>PUMPRESET_PW</description>
                     <bitRange>[15:4]</bitRange>
                  </field>
                  <field>
                     <name>PUMPPWR</name>
                     <description>PUMPPWR</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPAC2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8268</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PAGP</name>
                     <description>PAGP</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FMAC</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8272</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BANK</name>
                     <description>BANK</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
