cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>FMSTAT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8276</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RVSUSP</name>
                     <description>RVSUSP</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>RDVER</name>
                     <description>RDVER</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>RVF</name>
                     <description>RVF</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>ILA</name>
                     <description>ILA</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>DBF</name>
                     <description>DBF</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>PGV</name>
                     <description>PGV</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>PCV</name>
                     <description>PCV</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>EV</name>
                     <description>EV</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CV</name>
                     <description>CV</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>ERS</name>
                     <description>ERS</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>PGM</name>
                     <description>PGM</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>INVDAT</name>
                     <description>INVDAT</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>CSTAT</name>
                     <description>CSTAT</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>VOLSTAT</name>
                     <description>VOLSTAT</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>ESUSP</name>
                     <description>ESUSP</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>PSUSP</name>
                     <description>PSUSP</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>SLOCK</name>
                     <description>SLOCK</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLOCK</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8292</addressOffset>
               <access>read-write</access>
               <resetValue>0x000055aa</resetValue>
               <fields>
                  <field>
                     <name>ENCOM</name>
                     <description>ENCOM</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVREADCT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8320</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>VREADCT</name>
                     <description>VREADCT</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVHVCT1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8324</addressOffset>
               <access>read-write</access>
               <resetValue>0x00840088</resetValue>
               <fields>
                  <field>
                     <name>TRIM13_E</name>
                     <description>TRIM13_E</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>VHVCT_E</name>
                     <description>VHVCT_E</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>TRIM13_PV</name>
                     <description>TRIM13_PV</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>VHVCT_PV</name>
                     <description>VHVCT_PV</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVHVCT2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8328</addressOffset>
               <access>read-write</access>
               <resetValue>0x00a20000</resetValue>
               <fields>
                  <field>
                     <name>TRIM13_P</name>
                     <description>TRIM13_P</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>VHVCT_P</name>
                     <description>VHVCT_P</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVHVCT3</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8332</addressOffset>
               <access>read-write</access>
               <resetValue>0x000f0000</resetValue>
               <fields>
                  <field>
                     <name>WCT</name>
                     <description>WCT</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>VHVCT_READ</name>
                     <description>VHVCT_READ</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVNVCT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8336</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>VCG2P5CT</name>
                     <description>VCG2P5CT</description>
                     <bitRange>[12:8]</bitRange>
                  </field>
                  <field>
                     <name>VIN_CT</name>
                     <description>VIN_CT</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVSLP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8340</addressOffset>
               <access>read-write</access>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>VSL_P</name>
                     <description>VSL_P</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FVWLCT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8344</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000008</resetValue>
               <fields>
                  <field>
                     <name>VWLCT_P</name>
                     <description>VWLCT_P</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEFUSECTL</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8348</addressOffset>
               <access>read-write</access>
               <resetValue>0x0701010a</resetValue>
               <fields>
                  <field>
                     <name>CHAIN_SEL</name>
                     <description>CHAIN_SEL</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>WRITE_EN</name>
                     <description>WRITE_EN</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>BP_SEL</name>
                     <description>BP_SEL</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>EF_CLRZ</name>
                     <description>EF_CLRZ</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>EF_TEST</name>
                     <description>EF_TEST</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>EFUSE_EN</name>
                     <description>EFUSE_EN</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEFUSESTAT</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8352</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SHIFT_DONE</name>
                     <description>SHIFT_DONE</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEFUSEDATA</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8356</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FEFUSEDATA</name>
                     <description>FEFUSEDATA</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSEQPMP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8360</addressOffset>
               <access>read-write</access>
               <resetValue>0x85080000</resetValue>
               <fields>
                  <field>
                     <name>TRIM_3P4</name>
                     <description>TRIM_3P4</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>TRIM_1P7</name>
                     <description>TRIM_1P7</description>
                     <bitRange>[21:20]</bitRange>
                  </field>
                  <field>
                     <name>TRIM_0P8</name>
                     <description>TRIM_0P8</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>VIN_AT_X</name>
                     <description>VIN_AT_X</description>
                     <bitRange>[14:12]</bitRange>
                  </field>
                  <field>
                     <name>VIN_BY_PASS</name>
                     <description>VIN_BY_PASS</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBSTROBES</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8448</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000104</resetValue>
               <fields>
                  <field>
                     <name>ECBIT</name>
                     <description>ECBIT</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>RWAIT2_FLCLK</name>
                     <description>RWAIT2_FLCLK</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>RWAIT_FLCLK</name>
                     <description>RWAIT_FLCLK</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>FLCLKEN</name>
                     <description>FLCLKEN</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>CTRLENZ</name>
                     <description>CTRLENZ</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>NOCOLRED</name>
                     <description>NOCOLRED</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>PRECOL</name>
                     <description>PRECOL</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TI_OTP</name>
                     <description>TI_OTP</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>OTP</name>
                     <description>OTP</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>TEZ</name>
                     <description>TEZ</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FPSTROBES</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8452</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000103</resetValue>
               <fields>
                  <field>
                     <name>EXECUTEZ</name>
                     <description>EXECUTEZ</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>V3PWRDNZ</name>
                     <description>V3PWRDNZ</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>V5PWRDNZ</name>
                     <description>V5PWRDNZ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FBMODE</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8456</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>MODE</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTCR</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8460</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCR</name>
                     <description>TCR</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FADDR</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8464</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FADDR</name>
                     <description>FADDR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FTCTL</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8476</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDATA_BLK_CLR</name>
                     <description>WDATA_BLK_CLR</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>TEST_EN</name>
                     <description>TEST_EN</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8480</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE0</name>
                     <description>FWPWRITE0</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8484</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE1</name>
                     <description>FWPWRITE1</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8488</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE2</name>
                     <description>FWPWRITE2</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE3</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8492</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE3</name>
                     <description>FWPWRITE3</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE4</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8496</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE4</name>
                     <description>FWPWRITE4</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE5</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8500</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE5</name>
                     <description>FWPWRITE5</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FWPWRITE6</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8504</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FWPWRITE6</name>
                     <description>FWPWRITE6</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
