cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>FSM_ST_MACHINE</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8828</addressOffset>
               <access>read-write</access>
               <resetValue>0x00800500</resetValue>
               <fields>
                  <field>
                     <name>DO_PRECOND</name>
                     <description>DO_PRECOND</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>FSM_INT_EN</name>
                     <description>FSM_INT_EN</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>ALL_BANKS</name>
                     <description>ALL_BANKS</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>CMPV_ALLOWED</name>
                     <description>CMPV_ALLOWED</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>RANDOM</name>
                     <description>RANDOM</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>RV_SEC_EN</name>
                     <description>RV_SEC_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>RV_RES</name>
                     <description>RV_RES</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>RV_INT_EN</name>
                     <description>RV_INT_EN</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>ONE_TIME_GOOD</name>
                     <description>ONE_TIME_GOOD</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>DO_REDU_COL</name>
                     <description>DO_REDU_COL</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>DBG_SHORT_ROW</name>
                     <description>DBG_SHORT_ROW</description>
                     <bitRange>[10:7]</bitRange>
                  </field>
                  <field>
                     <name>PGM_SEC_COF_EN</name>
                     <description>PGM_SEC_COF_EN</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>PREC_STOP_EN</name>
                     <description>PREC_STOP_EN</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>DIS_TST_EN</name>
                     <description>DIS_TST_EN</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CMD_EN</name>
                     <description>CMD_EN</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>INV_DATA</name>
                     <description>INV_DATA</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>OVERRIDE</name>
                     <description>OVERRIDE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_FLES</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8832</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BLK_TIOTP</name>
                     <description>BLK_TIOTP</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>BLK_OTP</name>
                     <description>BLK_OTP</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_WR_ENA</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8840</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>WR_ENA</name>
                     <description>WR_ENA</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_ACC_PP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8844</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_ACC_PP</name>
                     <description>FSM_ACC_PP</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_ACC_EP</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8848</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACC_EP</name>
                     <description>ACC_EP</description>
                     <bitRange>[15:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_ADDR</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8864</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BANK</name>
                     <description>BANK</description>
                     <bitRange>[30:28]</bitRange>
                  </field>
                  <field>
                     <name>CUR_ADDR</name>
                     <description>CUR_ADDR</description>
                     <bitRange>[27:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_SECTOR</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8868</addressOffset>
               <access>read-write</access>
               <resetValue>0xffff0000</resetValue>
               <fields>
                  <field>
                     <name>SECT_ERASED</name>
                     <description>SECT_ERASED</description>
                     <bitRange>[31:16]</bitRange>
                  </field>
                  <field>
                     <name>FSM_SECTOR_EXTENSION</name>
                     <description>FSM_SECTOR_EXTENSION</description>
                     <bitRange>[15:8]</bitRange>
                  </field>
                  <field>
                     <name>SECTOR</name>
                     <description>SECTOR</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>SEC_OUT</name>
                     <description>SEC_OUT</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FMC_REV_ID</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8872</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MOD_VERSION</name>
                     <description>MOD_VERSION</description>
                     <bitRange>[31:12]</bitRange>
                  </field>
                  <field>
                     <name>CONFIG_CRC</name>
                     <description>CONFIG_CRC</description>
                     <bitRange>[11:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_ERR_ADDR</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8876</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_ERR_ADDR</name>
                     <description>FSM_ERR_ADDR</description>
                     <bitRange>[31:8]</bitRange>
                  </field>
                  <field>
                     <name>FSM_ERR_BANK</name>
                     <description>FSM_ERR_BANK</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_PGM_MAXPUL</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8880</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_PGM_MAXPUL</name>
                     <description>FSM_PGM_MAXPUL</description>
                     <bitRange>[11:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_EXECUTE</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8884</addressOffset>
               <access>read-write</access>
               <resetValue>0x000a000a</resetValue>
               <fields>
                  <field>
                     <name>SUSPEND_NOW</name>
                     <description>SUSPEND_NOW</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>FSMEXECUTE</name>
                     <description>FSMEXECUTE</description>
                     <bitRange>[4:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_SECTOR1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8896</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>FSM_SECTOR1</name>
                     <description>FSM_SECTOR1</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_SECTOR2</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8900</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_SECTOR2</name>
                     <description>FSM_SECTOR2</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_BSLE0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8928</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_BSLE0</name>
                     <description>FSM_BSLE0</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_BSLE1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8932</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_BSL1</name>
                     <description>FSM_BSL1</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_BSLP0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8944</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_BSLP0</name>
                     <description>FSM_BSLP0</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FSM_BSLP1</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>8948</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FSM_BSL1</name>
                     <description>FSM_BSL1</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_BANK</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9216</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000401</resetValue>
               <fields>
                  <field>
                     <name>EE_BANK_WIDTH</name>
                     <description>EE_BANK_WIDTH</description>
                     <bitRange>[31:20]</bitRange>
                  </field>
                  <field>
                     <name>EE_NUM_BANK</name>
                     <description>EE_NUM_BANK</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>MAIN_BANK_WIDTH</name>
                     <description>MAIN_BANK_WIDTH</description>
                     <bitRange>[15:4]</bitRange>
                  </field>
                  <field>
                     <name>MAIN_NUM_BANK</name>
                     <description>MAIN_NUM_BANK</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_WRAPPER</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9220</addressOffset>
               <access>read-only</access>
               <resetValue>0x50009007</resetValue>
               <fields>
                  <field>
                     <name>FAMILY_TYPE</name>
                     <description>FAMILY_TYPE</description>
                     <bitRange>[31:24]</bitRange>
                  </field>
                  <field>
                     <name>MEM_MAP</name>
                     <description>MEM_MAP</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>CPU2</name>
                     <description>CPU2</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>EE_IN_MAIN</name>
                     <description>EE_IN_MAIN</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>ROM</name>
                     <description>ROM</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>IFLUSH</name>
                     <description>IFLUSH</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>SIL3</name>
                     <description>SIL3</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>ECCA</name>
                     <description>ECCA</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>AUTO_SUSP</name>
                     <description>AUTO_SUSP</description>
                     <bitRange>[7:6]</bitRange>
                  </field>
                  <field>
                     <name>UERR</name>
                     <description>UERR</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>CPU_TYPE1</name>
                     <description>CPU_TYPE1</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_BNK_TYPE</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9224</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>B7_TYPE</name>
                     <description>B7_TYPE</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B6_TYPE</name>
                     <description>B6_TYPE</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B5_TYPE</name>
                     <description>B5_TYPE</description>
                     <bitRange>[23:20]</bitRange>
                  </field>
                  <field>
                     <name>B4_TYPE</name>
                     <description>B4_TYPE</description>
                     <bitRange>[19:16]</bitRange>
                  </field>
                  <field>
                     <name>B3_TYPE</name>
                     <description>B3_TYPE</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>B2_TYPE</name>
                     <description>B2_TYPE</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>B1_TYPE</name>
                     <description>B1_TYPE</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>B0_TYPE</name>
                     <description>B0_TYPE</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B0_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9232</addressOffset>
               <access>read-only</access>
               <resetValue>0x02000000</resetValue>
               <fields>
                  <field>
                     <name>B0_MAX_SECTOR</name>
                     <description>B0_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B0_MUX_FACTOR</name>
                     <description>B0_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B0_START_ADDR</name>
                     <description>B0_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B1_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9236</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B1_MAX_SECTOR</name>
                     <description>B1_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B1_MUX_FACTOR</name>
                     <description>B1_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B1_START_ADDR</name>
                     <description>B1_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B2_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9240</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B2_MAX_SECTOR</name>
                     <description>B2_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B2_MUX_FACTOR</name>
                     <description>B2_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B2_START_ADDR</name>
                     <description>B2_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
