cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>FCFG_B3_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9244</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B3_MAX_SECTOR</name>
                     <description>B3_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B3_MUX_FACTOR</name>
                     <description>B3_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B3_START_ADDR</name>
                     <description>B3_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B4_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9248</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B4_MAX_SECTOR</name>
                     <description>B4_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B4_MUX_FACTOR</name>
                     <description>B4_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B4_START_ADDR</name>
                     <description>B4_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B5_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9252</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B5_MAX_SECTOR</name>
                     <description>B5_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B5_MUX_FACTOR</name>
                     <description>B5_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B5_START_ADDR</name>
                     <description>B5_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B6_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9256</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B6_MAX_SECTOR</name>
                     <description>B6_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B6_MUX_FACTOR</name>
                     <description>B6_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B6_START_ADDR</name>
                     <description>B6_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B7_START</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9260</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>B7_MAX_SECTOR</name>
                     <description>B7_MAX_SECTOR</description>
                     <bitRange>[31:28]</bitRange>
                  </field>
                  <field>
                     <name>B7_MUX_FACTOR</name>
                     <description>B7_MUX_FACTOR</description>
                     <bitRange>[27:24]</bitRange>
                  </field>
                  <field>
                     <name>B7_START_ADDR</name>
                     <description>B7_START_ADDR</description>
                     <bitRange>[23:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG_B0_SSIZE0</name>
               <description>Internal. Only to be used through TI provided API.</description>
               <addressOffset>9264</addressOffset>
               <access>read-only</access>
               <resetValue>0x00200004</resetValue>
               <fields>
                  <field>
                     <name>B0_NUM_SECTORS</name>
                     <description>B0_NUM_SECTORS</description>
                     <bitRange>[27:16]</bitRange>
                  </field>
                  <field>
                     <name>B0_SECT_SIZE</name>
                     <description>B0_SECT_SIZE</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>GPIO</name>
         <description>MCU GPIO - I/F for controlling and reading IO status and IO event status

</description>
         <baseAddress>0x40022000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>DOUT3_0</name>
               <description>Data Out 0 to 3

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO3</name>
                     <description>DIO3</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO2</name>
                     <description>DIO2</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO1</name>
                     <description>DIO1</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO0</name>
                     <description>DIO0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT7_4</name>
               <description>Data Out 4 to 7

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO7</name>
                     <description>DIO7</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO6</name>
                     <description>DIO6</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO5</name>
                     <description>DIO5</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO4</name>
                     <description>DIO4</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT11_8</name>
               <description>Data Out 8 to 11

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO11</name>
                     <description>DIO11</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO10</name>
                     <description>DIO10</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO9</name>
                     <description>DIO9</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO8</name>
                     <description>DIO8</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT15_12</name>
               <description>Data Out 12 to 15

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO15</name>
                     <description>DIO15</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO14</name>
                     <description>DIO14</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO13</name>
                     <description>DIO13</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO12</name>
                     <description>DIO12</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT19_16</name>
               <description>Data Out 16 to 19

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO19</name>
                     <description>DIO19</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO18</name>
                     <description>DIO18</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO17</name>
                     <description>DIO17</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO16</name>
                     <description>DIO16</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT23_20</name>
               <description>Data Out 20 to 23

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO23</name>
                     <description>DIO23</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO22</name>
                     <description>DIO22</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO21</name>
                     <description>DIO21</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO20</name>
                     <description>DIO20</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT27_24</name>
               <description>Data Out 24 to 27

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO27</name>
                     <description>DIO27</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO26</name>
                     <description>DIO26</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO25</name>
                     <description>DIO25</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO24</name>
                     <description>DIO24</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT31_28</name>
               <description>Data Out 28 to 31

Alias register for byte access to each bit in DOUT31_0</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO31</name>
                     <description>DIO31</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO30</name>
                     <description>DIO30</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO29</name>
                     <description>DIO29</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO28</name>
                     <description>DIO28</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUT31_0</name>
               <description>Data Output for DIO 0 to 31</description>
               <addressOffset>128</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DIO31</name>
                     <description>DIO31</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>DIO30</name>
                     <description>DIO30</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>DIO29</name>
                     <description>DIO29</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>DIO28</name>
                     <description>DIO28</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>DIO27</name>
                     <description>DIO27</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>DIO26</name>
                     <description>DIO26</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>DIO25</name>
                     <description>DIO25</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>DIO24</name>
                     <description>DIO24</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>DIO23</name>
                     <description>DIO23</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>DIO22</name>
                     <description>DIO22</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>DIO21</name>
                     <description>DIO21</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>DIO20</name>
                     <description>DIO20</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>DIO19</name>
                     <description>DIO19</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>DIO18</name>
                     <description>DIO18</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>DIO17</name>
                     <description>DIO17</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>DIO16</name>
                     <description>DIO16</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DIO15</name>
                     <description>DIO15</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>DIO14</name>
                     <description>DIO14</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>DIO13</name>
                     <description>DIO13</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>DIO12</name>
                     <description>DIO12</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>DIO11</name>
                     <description>DIO11</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>DIO10</name>
                     <description>DIO10</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>DIO9</name>
                     <description>DIO9</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>DIO8</name>
                     <description>DIO8</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DIO7</name>
                     <description>DIO7</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>DIO6</name>
                     <description>DIO6</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>DIO5</name>
                     <description>DIO5</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>DIO4</name>
                     <description>DIO4</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>DIO3</name>
                     <description>DIO3</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>DIO2</name>
                     <description>DIO2</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>DIO1</name>
                     <description>DIO1</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DIO0</name>
                     <description>DIO0</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>DOUTSET31_0</name>
               <description>Data Out Set

