cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>GPT0</name>
         <description>General Purpose Timer.

</description>
         <baseAddress>0x40010000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CFG</name>
               <description>Configuration</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CFG</name>
                     <description>CFG</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAMR</name>
               <description>Timer A Mode

</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCACT</name>
                     <description>TCACT</description>
                     <bitRange>[15:13]</bitRange>
                  </field>
                  <field>
                     <name>TACINTD</name>
                     <description>TACINTD</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>TAPLO</name>
                     <description>TAPLO</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>TAMRSU</name>
                     <description>TAMRSU</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>TAPWMIE</name>
                     <description>TAPWMIE</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TAILD</name>
                     <description>TAILD</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TASNAPS</name>
                     <description>TASNAPS</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>TAWOT</name>
                     <description>TAWOT</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TAMIE</name>
                     <description>TAMIE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TACDIR</name>
                     <description>TACDIR</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TAAMS</name>
                     <description>TAAMS</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>TACM</name>
                     <description>TACM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>TAMR</name>
                     <description>TAMR</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBMR</name>
               <description>Timer B Mode

</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TCACT</name>
                     <description>TCACT</description>
                     <bitRange>[15:13]</bitRange>
                  </field>
                  <field>
                     <name>TBCINTD</name>
                     <description>TBCINTD</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>TBPLO</name>
                     <description>TBPLO</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>TBMRSU</name>
                     <description>TBMRSU</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>TBPWMIE</name>
                     <description>TBPWMIE</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TBILD</name>
                     <description>TBILD</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TBSNAPS</name>
                     <description>TBSNAPS</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>TBWOT</name>
                     <description>TBWOT</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TBMIE</name>
                     <description>TBMIE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TBCDIR</name>
                     <description>TBCDIR</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TBAMS</name>
                     <description>TBAMS</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>TBCM</name>
                     <description>TBCM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>TBMR</name>
                     <description>TBMR</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <description>Control</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TBPWML</name>
                     <description>TBPWML</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>TBEVENT</name>
                     <description>TBEVENT</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>TBSTALL</name>
                     <description>TBSTALL</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TBEN</name>
                     <description>TBEN</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TAPWML</name>
                     <description>TAPWML</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>RTCEN</name>
                     <description>RTCEN</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>TAEVENT</name>
                     <description>TAEVENT</description>
                     <bitRange>[3:2]</bitRange>
                  </field>
                  <field>
                     <name>TASTALL</name>
                     <description>TASTALL</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>TAEN</name>
                     <description>TAEN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYNC</name>
               <description>Synch Register

</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SYNC3</name>
                     <description>SYNC3</description>
                     <bitRange>[7:6]</bitRange>
                  </field>
                  <field>
                     <name>SYNC2</name>
                     <description>SYNC2</description>
                     <bitRange>[5:4]</bitRange>
                  </field>
                  <field>
                     <name>SYNC1</name>
                     <description>SYNC1</description>
                     <bitRange>[3:2]</bitRange>
                  </field>
                  <field>
                     <name>SYNC0</name>
                     <description>SYNC0</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IMR</name>
               <description>Interrupt Mask
This register is used to enable the interrupts.
Associated registers:
RIS, MIS, ICLR

</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUMIS</name>
                     <description>WUMIS</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DMABIM</name>
                     <description>DMABIM</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>TBMIM</name>
                     <description>TBMIM</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>CBEIM</name>
                     <description>CBEIM</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CBMIM</name>
                     <description>CBMIM</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TBTOIM</name>
                     <description>TBTOIM</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DMAAIM</name>
                     <description>DMAAIM</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TAMIM</name>
                     <description>TAMIM</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RTCIM</name>
                     <description>RTCIM</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CAEIM</name>
                     <description>CAEIM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CAMIM</name>
                     <description>CAMIM</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>TATOIM</name>
                     <description>TATOIM</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RIS</name>
               <description>Raw Interrupt Status
Associated registers:
IMR, MIS, ICLR

</description>
               <addressOffset>28</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WURIS</name>
                     <description>WURIS</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DMABRIS</name>
                     <description>DMABRIS</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>TBMRIS</name>
                     <description>TBMRIS</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>CBERIS</name>
                     <description>CBERIS</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CBMRIS</name>
                     <description>CBMRIS</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TBTORIS</name>
                     <description>TBTORIS</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DMAARIS</name>
                     <description>DMAARIS</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TAMRIS</name>
                     <description>TAMRIS</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RTCRIS</name>
                     <description>RTCRIS</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CAERIS</name>
                     <description>CAERIS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CAMRIS</name>
                     <description>CAMRIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>TATORIS</name>
                     <description>TATORIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MIS</name>
               <description>Masked Interrupt Status
Values are result of bitwise AND operation between RIS and IMR
Assosciated clear register: ICLR

</description>
               <addressOffset>32</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUMIS</name>
                     <description>WUMIS</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>DMABMIS</name>
                     <description>DMABMIS</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>TBMMIS</name>
                     <description>TBMMIS</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>CBEMIS</name>
                     <description>CBEMIS</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>CBMMIS</name>
                     <description>CBMMIS</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TBTOMIS</name>
                     <description>TBTOMIS</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>DMAAMIS</name>
                     <description>DMAAMIS</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TAMMIS</name>
                     <description>TAMMIS</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>RTCMIS</name>
                     <description>RTCMIS</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CAEMIS</name>
                     <description>CAEMIS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CAMMIS</name>
                     <description>CAMMIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>TATOMIS</name>
                     <description>TATOMIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICLR</name>
               <description>Interrupt Clear
This register is used to clear status bits in the RIS and MIS registers</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WUECINT</name>
                     <description>WUECINT</description>
                     <bitRange>[16:16]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DMABINT</name>
                     <description>DMABINT</description>
                     <bitRange>[13:13]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TBMCINT</name>
                     <description>TBMCINT</description>
                     <bitRange>[11:11]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>CBECINT</name>
                     <description>CBECINT</description>
                     <bitRange>[10:10]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>CBMCINT</name>
                     <description>CBMCINT</description>
                     <bitRange>[9:9]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TBTOCINT</name>
                     <description>TBTOCINT</description>
                     <bitRange>[8:8]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>DMAAINT</name>
                     <description>DMAAINT</description>
                     <bitRange>[5:5]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TAMCINT</name>
                     <description>TAMCINT</description>
                     <bitRange>[4:4]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>RTCCINT</name>
                     <description>RTCCINT</description>
                     <bitRange>[3:3]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>CAECINT</name>
                     <description>CAECINT</description>
                     <bitRange>[2:2]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>CAMCINT</name>
                     <description>CAMCINT</description>
                     <bitRange>[1:1]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
                  <field>
                     <name>TATOCINT</name>
                     <description>TATOCINT</description>
                     <bitRange>[0:0]</bitRange>
                     <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAILR</name>
               <description>Timer A Interval Load  Register</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0xffffffff</resetValue>
               <fields>
                  <field>
                     <name>TAILR</name>
                     <description>TAILR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TBILR</name>
               <description>Timer B Interval Load  Register</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000ffff</resetValue>
               <fields>
                  <field>
                     <name>TBILR</name>
                     <description>TBILR</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>TAMATCHR</name>
               <description>Timer A Match Register

Interrupts can be generated when the timer value is equal to the value in this register in one-shot or periodic mode.

In Edge-Count mode, this register along with TAILR, determines how many edge events are counted.
The total number of edge events counted is equal to the value in TAILR minus this value.

Note that in edge-count mode, when executing an up-count, the value of TAPR and TAILR must be greater than the value of TAPMR and TAMATCHR.

In PWM mode, this value along with TAILR, determines the duty cycle of the output PWM signal.

When a 16/32-bit GPT is configured to one of the 32-bit modes, TAMATCHR appears as a 32-bit register. (The upper 16-bits correspond to the contents TBMATCHR).

