cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>I2C0</name>
         <description>I2CMaster/Slave Serial Controler

</description>
         <baseAddress>0x40002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SOAR</name>
               <description>Slave Own Address
This register consists of seven address bits that identify this I2C device on the I2C bus.</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OAR</name>
                     <description>OAR</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSTAT</name>
               <description>Slave Status 
Note: This register shares address with SCTL, meaning that this register functions as a control register when written, and a status register when read.</description>
               <addressOffset>4</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FBR</name>
                     <description>FBR</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>TREQ</name>
                     <description>TREQ</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RREQ</name>
                     <description>RREQ</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCTL</name>
               <description>Slave Control
Note: This register shares address with SSTAT, meaning that this register functions as a control register when written, and a status register when read.</description>
               <addressOffset>4</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DA</name>
                     <description>DA</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>SSTAT</alternateRegister></register>
            <register>
               <name>SDR</name>
               <description>Slave Data
This register contains the data to be transmitted when in the Slave Transmit state, and the data received when in the Slave Receive state.</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIMR</name>
               <description>Slave Interrupt Mask
This register controls whether a raw interrupt is promoted to a controller interrupt.</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STOPIM</name>
                     <description>STOPIM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>STARTIM</name>
                     <description>STARTIM</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DATAIM</name>
                     <description>DATAIM</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRIS</name>
               <description>Slave Raw Interrupt Status
This register shows the unmasked interrupt status.</description>
               <addressOffset>16</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STOPRIS</name>
                     <description>STOPRIS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>STARTRIS</name>
                     <description>STARTRIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DATARIS</name>
                     <description>DATARIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMIS</name>
               <description>Slave Masked Interrupt Status
This register show which interrupt is active (based on result from SRIS and SIMR).</description>
               <addressOffset>20</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STOPMIS</name>
                     <description>STOPMIS</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>STARTMIS</name>
                     <description>STARTMIS</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DATAMIS</name>
                     <description>DATAMIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SICR</name>
               <description>Slave Interrupt Clear
This register clears the raw interrupt SRIS.</description>
               <addressOffset>24</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STOPIC</name>
                     <description>STOPIC</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>STARTIC</name>
                     <description>STARTIC</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>DATAIC</name>
                     <description>DATAIC</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSA</name>
               <description>Master Salve Address
This register contains seven address bits of the slave to be accessed by the master (a6-a0), and an RS bit determining if the next operation is a receive or transmit.</description>
               <addressOffset>2048</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SA</name>
                     <description>SA</description>
                     <bitRange>[7:1]</bitRange>
                  </field>
                  <field>
                     <name>RS</name>
                     <description>RS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MSTAT</name>
               <description>Master Status

</description>
               <addressOffset>2052</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000020</resetValue>
               <fields>
                  <field>
                     <name>BUSBSY</name>
                     <description>BUSBSY</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>IDLE</name>
                     <description>IDLE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>ARBLST</name>
                     <description>ARBLST</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>DATACK_N</name>
                     <description>DATACK_N</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>ADRACK_N</name>
                     <description>ADRACK_N</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>ERR</name>
                     <description>ERR</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCTRL</name>
               <description>Master Control

This register accesses status bits when read and control bits when written. When read, the status register indicates the state of the I2C bus controller as stated in MSTAT. When written, the control register configures the I2C controller operation.

To generate a single transmit cycle, the I2C Master Slave Address (MSA) register is written with the desired address, the MSA.RS bit is cleared, and this register is written with 
* ACK=X (0 or 1), 
* STOP=1, 
* START=1, 
* RUN=1 
to perform the operation and stop. 
When the operation is completed (or aborted due an error), an interrupt becomes active and the data may be read from the MDR register. </description>
               <addressOffset>2052</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACK</name>
                     <description>ACK</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>STOP</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>START</name>
                     <description>START</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RUN</name>
                     <description>RUN</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            <alternateRegister>MSTAT</alternateRegister></register>
            <register>
               <name>MDR</name>
               <description>Master Data
This register contains the data to be transmitted when in the Master Transmit state and the data received when in the Master Receive state.</description>
               <addressOffset>2056</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>DATA</description>
                     <bitRange>[7:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MTPR</name>
               <description>I2C Master Timer Period
This register specifies the period of the SCL clock.</description>
               <addressOffset>2060</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>TPR_7</name>
                     <description>TPR_7</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>TPR</name>
                     <description>TPR</description>
                     <bitRange>[6:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MIMR</name>
               <description>Master Interrupt Mask
This register controls whether a raw interrupt is promoted to a controller interrupt.</description>
               <addressOffset>2064</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IM</name>
                     <description>IM</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MRIS</name>
               <description>Master Raw Interrupt Status
This register show the unmasked interrupt status.</description>
               <addressOffset>2068</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RIS</name>
                     <description>RIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MMIS</name>
               <description>Master Masked Interrupt Status
This register show which interrupt is active (based on result from MRIS and MIMR).</description>
               <addressOffset>2072</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MIS</name>
                     <description>MIS</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MICR</name>
               <description>Master Interrupt Clear
This register clears the raw and masked interrupt.</description>
               <addressOffset>2076</addressOffset>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC</name>
                     <description>IC</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCR</name>
               <description>Master Configuration
This register configures the mode (Master or Slave) and sets the interface for test mode loopback.</description>
               <addressOffset>2080</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SFE</name>
                     <description>SFE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>MFE</name>
                     <description>MFE</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>LPBK</name>
                     <description>LPBK</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
