cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>IOC</name>
         <description>IO Controller (IOC) - configures all the DIOs and resides in the MCU domain.

</description>
         <baseAddress>0x40081000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IOCFG0</name>
               <description>Configuration of DIO0</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG1</name>
               <description>Configuration of DIO1</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG2</name>
               <description>Configuration of DIO2</description>
               <addressOffset>8</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG3</name>
               <description>Configuration of DIO3</description>
               <addressOffset>12</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG4</name>
               <description>Configuration of DIO4</description>
               <addressOffset>16</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG5</name>
               <description>Configuration of DIO5</description>
               <addressOffset>20</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG6</name>
               <description>Configuration of DIO6</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG7</name>
               <description>Configuration of DIO7</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG8</name>
               <description>Configuration of DIO8</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
