cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>IOCFG9</name>
               <description>Configuration of DIO9</description>
               <addressOffset>36</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG10</name>
               <description>Configuration of DIO10</description>
               <addressOffset>40</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG11</name>
               <description>Configuration of DIO11</description>
               <addressOffset>44</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG12</name>
               <description>Configuration of DIO12</description>
               <addressOffset>48</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG13</name>
               <description>Configuration of DIO13</description>
               <addressOffset>52</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG14</name>
               <description>Configuration of DIO14</description>
               <addressOffset>56</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG15</name>
               <description>Configuration of DIO15</description>
               <addressOffset>60</addressOffset>
               <access>read-write</access>
               <resetValue>0x00006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG16</name>
               <description>Configuration of DIO16</description>
               <addressOffset>64</addressOffset>
               <access>read-write</access>
               <resetValue>0x00086000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOCFG17</name>
               <description>Configuration of DIO17</description>
               <addressOffset>68</addressOffset>
               <access>read-write</access>
               <resetValue>0x8000006000</resetValue>
               <fields>
                  <field>
                     <name>HYST_EN</name>
                     <description>HYST_EN</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>IE</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>WU_CFG</name>
                     <description>WU_CFG</description>
                     <bitRange>[28:27]</bitRange>
                  </field>
                  <field>
                     <name>IOMODE</name>
                     <description>IOMODE</description>
                     <bitRange>[26:24]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_IRQ_EN</name>
                     <description>EDGE_IRQ_EN</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>EDGE_DET</name>
                     <description>EDGE_DET</description>
                     <bitRange>[17:16]</bitRange>
                  </field>
                  <field>
                     <name>PULL_CTL</name>
                     <description>PULL_CTL</description>
                     <bitRange>[14:13]</bitRange>
                  </field>
                  <field>
                     <name>SLEW_RED</name>
                     <description>SLEW_RED</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>IOCURR</name>
                     <description>IOCURR</description>
                     <bitRange>[11:10]</bitRange>
                  </field>
                  <field>
                     <name>IOSTR</name>
                     <description>IOSTR</description>
                     <bitRange>[9:8]</bitRange>
                  </field>
                  <field>
                     <name>PORT_ID</name>
                     <description>PORT_ID</description>
                     <bitRange>[5:0]</bitRange>
                  </field>
               </fields>
            </register>
