cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>PDCTL0</name>
               <description>Power Domain Control</description>
               <addressOffset>300</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PERIPH_ON</name>
                     <description>PERIPH_ON</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>SERIAL_ON</name>
                     <description>SERIAL_ON</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RFC_ON</name>
                     <description>RFC_ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL0RFC</name>
               <description>RFC Power Domain Control</description>
               <addressOffset>304</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL0SERIAL</name>
               <description>SERIAL Power Domain Control</description>
               <addressOffset>308</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL0PERIPH</name>
               <description>PERIPH Power Domain Control</description>
               <addressOffset>312</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT0</name>
               <description>Power Domain Status</description>
               <addressOffset>320</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PERIPH_ON</name>
                     <description>PERIPH_ON</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>SERIAL_ON</name>
                     <description>SERIAL_ON</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RFC_ON</name>
                     <description>RFC_ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT0RFC</name>
               <description>RFC Power Domain Status</description>
               <addressOffset>324</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT0SERIAL</name>
               <description>SERIAL Power Domain Status</description>
               <addressOffset>328</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT0PERIPH</name>
               <description>PERIPH Power Domain Status</description>
               <addressOffset>332</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL1</name>
               <description>Power Domain Control</description>
               <addressOffset>380</addressOffset>
               <access>read-write</access>
               <resetValue>0x0000000a</resetValue>
               <fields>
                  <field>
                     <name>VIMS_MODE</name>
                     <description>VIMS_MODE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RFC_ON</name>
                     <description>RFC_ON</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CPU_ON</name>
                     <description>CPU_ON</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL1CPU</name>
               <description>CPU Power Domain Control</description>
               <addressOffset>388</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL1RFC</name>
               <description>RFC Power Domain Control</description>
               <addressOffset>392</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDCTL1VIMS</name>
               <description>VIMS Power Domain Control</description>
               <addressOffset>396</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT1</name>
               <description>Power Domain Status</description>
               <addressOffset>404</addressOffset>
               <access>read-only</access>
               <resetValue>0x0000001a</resetValue>
               <fields>
                  <field>
                     <name>BUS_ON</name>
                     <description>BUS_ON</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>VIMS_MODE</name>
                     <description>VIMS_MODE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>RFC_ON</name>
                     <description>RFC_ON</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CPU_ON</name>
                     <description>CPU_ON</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT1BUS</name>
               <description>BUS Power Domain Status</description>
               <addressOffset>408</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT1RFC</name>
               <description>RFC Power Domain Status</description>
               <addressOffset>412</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT1CPU</name>
               <description>CPU Power Domain Status</description>
               <addressOffset>416</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDSTAT1VIMS</name>
               <description>VIMS Power Domain Status</description>
               <addressOffset>420</addressOffset>
               <access>read-only</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>ON</name>
                     <description>ON</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFCMODESEL</name>
               <description>Selected RFC Mode</description>
               <addressOffset>464</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CURR</name>
                     <description>CURR</description>
                     <bitRange>[2:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RAMRETEN</name>
               <description>Memory Retention Control</description>
               <addressOffset>548</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>RFC</name>
                     <description>RFC</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>VIMS</name>
                     <description>VIMS</description>
                     <bitRange>[1:0]</bitRange>
                  </field>
               </fields>
            </register>
