cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
            <register>
               <name>RFCPEISL</name>
               <description>Interrupt Vector Selection For Command and Packet Engine Generated Interrupts</description>
               <addressOffset>24</addressOffset>
               <access>read-write</access>
               <resetValue>0xffff0000</resetValue>
               <fields>
                  <field>
                     <name>INTERNAL_ERROR</name>
                     <description>INTERNAL_ERROR</description>
                     <bitRange>[31:31]</bitRange>
                  </field>
                  <field>
                     <name>BOOT_DONE</name>
                     <description>BOOT_DONE</description>
                     <bitRange>[30:30]</bitRange>
                  </field>
                  <field>
                     <name>MODULES_UNLOCKED</name>
                     <description>MODULES_UNLOCKED</description>
                     <bitRange>[29:29]</bitRange>
                  </field>
                  <field>
                     <name>SYNTH_NO_LOCK</name>
                     <description>SYNTH_NO_LOCK</description>
                     <bitRange>[28:28]</bitRange>
                  </field>
                  <field>
                     <name>IRQ27</name>
                     <description>IRQ27</description>
                     <bitRange>[27:27]</bitRange>
                  </field>
                  <field>
                     <name>RX_ABORTED</name>
                     <description>RX_ABORTED</description>
                     <bitRange>[26:26]</bitRange>
                  </field>
                  <field>
                     <name>RX_N_DATA_WRITTEN</name>
                     <description>RX_N_DATA_WRITTEN</description>
                     <bitRange>[25:25]</bitRange>
                  </field>
                  <field>
                     <name>RX_DATA_WRITTEN</name>
                     <description>RX_DATA_WRITTEN</description>
                     <bitRange>[24:24]</bitRange>
                  </field>
                  <field>
                     <name>RX_ENTRY_DONE</name>
                     <description>RX_ENTRY_DONE</description>
                     <bitRange>[23:23]</bitRange>
                  </field>
                  <field>
                     <name>RX_BUF_FULL</name>
                     <description>RX_BUF_FULL</description>
                     <bitRange>[22:22]</bitRange>
                  </field>
                  <field>
                     <name>RX_CTRL_ACK</name>
                     <description>RX_CTRL_ACK</description>
                     <bitRange>[21:21]</bitRange>
                  </field>
                  <field>
                     <name>RX_CTRL</name>
                     <description>RX_CTRL</description>
                     <bitRange>[20:20]</bitRange>
                  </field>
                  <field>
                     <name>RX_EMPTY</name>
                     <description>RX_EMPTY</description>
                     <bitRange>[19:19]</bitRange>
                  </field>
                  <field>
                     <name>RX_IGNORED</name>
                     <description>RX_IGNORED</description>
                     <bitRange>[18:18]</bitRange>
                  </field>
                  <field>
                     <name>RX_NOK</name>
                     <description>RX_NOK</description>
                     <bitRange>[17:17]</bitRange>
                  </field>
                  <field>
                     <name>RX_OK</name>
                     <description>RX_OK</description>
                     <bitRange>[16:16]</bitRange>
                  </field>
                  <field>
                     <name>IRQ15</name>
                     <description>IRQ15</description>
                     <bitRange>[15:15]</bitRange>
                  </field>
                  <field>
                     <name>IRQ14</name>
                     <description>IRQ14</description>
                     <bitRange>[14:14]</bitRange>
                  </field>
                  <field>
                     <name>IRQ13</name>
                     <description>IRQ13</description>
                     <bitRange>[13:13]</bitRange>
                  </field>
                  <field>
                     <name>IRQ12</name>
                     <description>IRQ12</description>
                     <bitRange>[12:12]</bitRange>
                  </field>
                  <field>
                     <name>TX_BUFFER_CHANGED</name>
                     <description>TX_BUFFER_CHANGED</description>
                     <bitRange>[11:11]</bitRange>
                  </field>
                  <field>
                     <name>TX_ENTRY_DONE</name>
                     <description>TX_ENTRY_DONE</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>TX_RETRANS</name>
                     <description>TX_RETRANS</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>TX_CTRL_ACK_ACK</name>
                     <description>TX_CTRL_ACK_ACK</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>TX_CTRL_ACK</name>
                     <description>TX_CTRL_ACK</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>TX_CTRL</name>
                     <description>TX_CTRL</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>TX_ACK</name>
                     <description>TX_ACK</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>TX_DONE</name>
                     <description>TX_DONE</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>LAST_FG_COMMAND_DONE</name>
                     <description>LAST_FG_COMMAND_DONE</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>FG_COMMAND_DONE</name>
                     <description>FG_COMMAND_DONE</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>LAST_COMMAND_DONE</name>
                     <description>LAST_COMMAND_DONE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>COMMAND_DONE</name>
                     <description>COMMAND_DONE</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RFACKIFG</name>
               <description>Doorbell Command Acknowledgement Interrupt Flag</description>
               <addressOffset>28</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACKFLAG</name>
                     <description>ACKFLAG</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>SYSGPOCTL</name>
               <description>RF Core General Purpose Output Control</description>
               <addressOffset>32</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GPOCTL3</name>
                     <description>GPOCTL3</description>
                     <bitRange>[15:12]</bitRange>
                  </field>
                  <field>
                     <name>GPOCTL2</name>
                     <description>GPOCTL2</description>
                     <bitRange>[11:8]</bitRange>
                  </field>
                  <field>
                     <name>GPOCTL1</name>
                     <description>GPOCTL1</description>
                     <bitRange>[7:4]</bitRange>
                  </field>
                  <field>
                     <name>GPOCTL0</name>
                     <description>GPOCTL0</description>
                     <bitRange>[3:0]</bitRange>
                  </field>
               </fields>
            </register>
