cmsis-svd/cmsis-svd/data/TexasInstruments/CC26x0.svd
         </registers>
      </peripheral><peripheral>
         <name>RFC_PWR</name>
         <description>RF Core Power Management</description>
         <baseAddress>0x40040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PWMCLKEN</name>
               <description>RF Core Power Management and Clock Enable</description>
               <addressOffset>0</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>RFCTRC</name>
                     <description>RFCTRC</description>
                     <bitRange>[10:10]</bitRange>
                  </field>
                  <field>
                     <name>FSCA</name>
                     <description>FSCA</description>
                     <bitRange>[9:9]</bitRange>
                  </field>
                  <field>
                     <name>PHA</name>
                     <description>PHA</description>
                     <bitRange>[8:8]</bitRange>
                  </field>
                  <field>
                     <name>RAT</name>
                     <description>RAT</description>
                     <bitRange>[7:7]</bitRange>
                  </field>
                  <field>
                     <name>RFERAM</name>
                     <description>RFERAM</description>
                     <bitRange>[6:6]</bitRange>
                  </field>
                  <field>
                     <name>RFE</name>
                     <description>RFE</description>
                     <bitRange>[5:5]</bitRange>
                  </field>
                  <field>
                     <name>MDMRAM</name>
                     <description>MDMRAM</description>
                     <bitRange>[4:4]</bitRange>
                  </field>
                  <field>
                     <name>MDM</name>
                     <description>MDM</description>
                     <bitRange>[3:3]</bitRange>
                  </field>
                  <field>
                     <name>CPERAM</name>
                     <description>CPERAM</description>
                     <bitRange>[2:2]</bitRange>
                  </field>
                  <field>
                     <name>CPE</name>
                     <description>CPE</description>
                     <bitRange>[1:1]</bitRange>
                  </field>
                  <field>
                     <name>RFC</name>
                     <description>RFC</description>
                     <bitRange>[0:0]</bitRange>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral><peripheral>
         <name>RFC_RAT</name>
         <description>RF Core Radio Timer</description>
         <baseAddress>0x40043000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RATCNT</name>
               <description>Radio Timer Counter Value</description>
               <addressOffset>4</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>CNT</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH0VAL</name>
               <description>Timer Channel 0 Capture/Compare Register</description>
               <addressOffset>128</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH1VAL</name>
               <description>Timer Channel 1 Capture/Compare Register</description>
               <addressOffset>132</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH2VAL</name>
               <description>Timer Channel 2 Capture/Compare Register</description>
               <addressOffset>136</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH3VAL</name>
               <description>Timer Channel 3 Capture/Compare Register</description>
               <addressOffset>140</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH4VAL</name>
               <description>Timer Channel 4 Capture/Compare Register</description>
               <addressOffset>144</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH5VAL</name>
               <description>Timer Channel 5 Capture/Compare Register</description>
               <addressOffset>148</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH6VAL</name>
               <description>Timer Channel 6 Capture/Compare Register</description>
               <addressOffset>152</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
            <register>
               <name>RATCH7VAL</name>
               <description>Timer Channel 7 Capture/Compare Register</description>
               <addressOffset>156</addressOffset>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VAL</name>
                     <description>VAL</description>
                     <bitRange>[31:0]</bitRange>
                  </field>
               </fields>
            </register>
